[
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Fumio-Hayashi/9780691010182?ref=grid-view&qid=1662452982903&sr=1-1",
		"Description": "Hayashi's Econometrics promises to be the next great synthesis of modern econometrics. It introduces first year Ph.D. students to standard graduate econometrics material from a modern perspective. It covers all the standard material necessary for understanding the principal techniques of econometrics from ordinary least squares through cointegration. The book is also distinctive in developing both time-series and cross-section analysis fully, giving the reader a unified framework for understanding and integrating results. Econometrics has many useful features and covers all the important topics in econometrics in a succinct manner. All the estimation techniques that could possibly be taught in a first-year graduate course, except maximum likelihood, are treated as special cases of GMM (generalized methods of moments). Maximum likelihood estimators for a variety of models (such as probit and tobit) are collected in a separate chapter. This arrangement enables students to learn various estimation techniques in an efficient manner.\n                            Eight of the ten chapters include a serious empirical application drawn from labor economics, industrial organization, domestic and international finance, and macroeconomics. These empirical exercises at the end of each chapter provide students a hands-on experience applying the techniques covered in the chapter. The exposition is rigorous yet accessible to students who have a working knowledge of very basic linear algebra and probability theory. All the results are stated as propositions, so that students can see the points of the discussion and also the conditions under which those results hold. Most propositions are proved in the text. For those who intend to write a thesis on applied topics, the empirical applications of the book are a good way to learn how to conduct empirical research. For the theoretically inclined, the no-compromise treatment of the basic techniques is a good preparation for more advanced theory courses.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Fumio-Hayashi/9780691010182?ref=grid-view&qid=1662452982903&sr=1-1",
		"Review": "I have some misgivings about the field of econometrics, fundamental elements are missing, and traditionally even if GMM estimation, is within the realm of admissable methods in statistics, it is quite fringe. This is also true of MA, ARMA and ARIMA for me, because in the case of economics they are not backed by fundamentals, nor do they elucidate them, given a theoretical mismatched. This is on some level, the same misgivings I have for Robert Lucas Jr.'s attempt to bridge micro to macro, through the use of statistical methods. There is some intuition or concept gap, where certain things are not being bridged. At least from what limited I have read. Perhaps, this is worthy of some further exploration."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Fumio-Hayashi/9780691010182?ref=grid-view&qid=1662452982903&sr=1-1",
		"Review": "A great introduction to graduate-level econometrics, especially because it ties almost everything under a generalized method of moments (GMM) framework (OLS, GLS, IV, 2SLS, SUR, 3SLS, random and fixed effects models, etc.), something which I failed to appreciate until the end of the first year of my graduate econometrics curriculum.The one criticism I have is that occasionally the notation was hard to follow, since most textbooks reserve X for (possibly endogenous) regressors and Z for instruments, whereas Hayashi prefers the complete opposite."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Fumio-Hayashi/9780691010182?ref=grid-view&qid=1662452982903&sr=1-1",
		"Review": "routinely chose the wrong greek letters"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Fumio-Hayashi/9780691010182?ref=grid-view&qid=1662452982903&sr=1-1",
		"Review": "Nice overview of several topics in econometrics, with a unifying GMM approach."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Description": "The core methods in today's econometric toolkit are linear regression for statistical control, instrumental variables methods for the analysis of natural experiments, and differences-in-differences methods that exploit policy changes. In the modern experimentalist paradigm, these techniques address clear causal questions such as: Do smaller classes increase learning? Should wife batterers be arrested? How much does education raise wages? Mostly Harmless Econometrics shows how the basic tools of applied econometrics allow the data to speak. In addition to econometric essentials, Mostly Harmless Econometrics covers important new extensions--regression-discontinuity designs and quantile regression--as well as how to get standard errors right. Joshua Angrist and Jorn-Steffen Pischke explain why fancier econometric techniques are typically unnecessary and even dangerous. The applied econometric methods emphasized in this book are easy to use and relevant for many areas of contemporary social science.\n                            * An irreverent review of econometric essentials  * A focus on tools that applied researchers use most  * Chapters on regression-discontinuity designs, quantile regression, and standard errors  * Many empirical examples  * A clear and concise resource with wide applications\n"
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Okay so my brother wrote it and I didn't understand a lot of it. But if you liked Freakonomics and want to geta bit more technical, it's totally for you. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "A decent book if you already know your econometrics. Don't be fooled by the title and other playful aspects of the book's presentation though--it is a serious econometrics book and not for beginners."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "The professor of my econometrics class last semester (the first econometrics class I'd ever taken) recommended this book as a supplement to class/our textbook. The book takes a lighthearted (at times humorous) approach, and does a good job explaining the big picture. However, it seems to not really be for people who have taken only one class in the subject, so I spent a lot of time either going back through the textbook or just plain confused. It's clearly a very good resource, but I would have gotten much more out of it if I had more background in the field."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Well, the general framing of this book is just awful. Having no prior knowledge of econometrics and reading it is a pure waste of time as it assumes a great amount of a priori knowledge. Therefore I consider it to be extremely problematic that nowhere in the beginning the target audience is clearly defined. And even if you have a decent amount of knowledge in econometrics this is not going to be easy. To be honest I read this book while working through Woolridge's famous Econometric Analysis of Cross-Section and Panel-Data and for every 10 pages I read in the Woolridge I was just able to understand one in Mostly Harmless Econometrics. Wrapping your head around the conditional-expectation-causal-analysis framework is time-consuming, but on the other hand it describes a perspective on econometrics and empirical research in a totally different way and gives many fascinating insights. But to really appreciate that you need some good foundations in statistics and econometrics. Therefore I consider this book to be everything but not harmless."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "A good book, but you definitely need to know econometrics before diving into this one. So it's not \"pop economics\" like Freakonomics. There's a decent review also at the Econometrics Books website."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Pretty good book for econometrics if you want to understand how econometrics experiments work and what are some of the most important checks that you need to do in order to have unbiased results."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "man I read this thing cover to cover so I'm counting it towards my total and you can't stop me"
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Not an introductory book to econometrics for sure, but if you've already taken courses that cover basic asymptotics and have been introduced to stuff like instrumental variables and fixed effects models, you are going to get a lot of mileage out of this book.Angrist and Pischke put causal identification and inference front-and-center in this book, beginning with Rubin's potential outcomes model, the selection bias problem, and the ideal of a randomized experiment. In practice, we are often stuck with observational data, so a second-best identification strategy will involve seeking out natural or quasi-experiments. This is where the authors really shine, often using classic papers as case studies in, say, differences-in-differences or regression discontinuity design.At times they skip over the technical details on certain topics, which is why I'm only giving it 4/5, but to be honest their main concern is general ideas and providing the reader some tricks of the trade. If you want to see why a fixed effects estimator is asymptotically more efficient than a first differences estimator, go read Jeff Wooldridge's Econometric Analysis. If you want a great sampling of an experimentalist perspective on econometric issues, this is a must-have."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "This is an excellent book on causal inference for econometrics and related problems (many observations, some unobserved covariates, no randomized experiment or only partial compliance in the experiment). If you want to learn about propensity score matching, discontinuity regression, and a hell of a lot about instrumental variables, this is the book for you.As a minimum preparation, I think you would need to read and clearly understand parts 1 and 2 of Data Analysis Using Regression and Multilevel/Hierarchical Models before reading this book. It is written in a style which is at times humorous, but don't let this mislead you into thinking that it is for a general audience; this is a highly technical book and at times it's tough going. You'll want a thorough understanding of the linear algebra behind OLS, and this book is often cursory on the derivations."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "As his other brother I couldn't agree more..."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Not too technical, has plenty of advice for empiricists, quite funny sometimes, too. Works better as a complement, starts out simple but later still assumes quite some basic background in econometrics, naturally so as the problems become harder and bigger. Leaves out a bunch of things to keep the book short, but makes me scratch my head since I want to know in details what was going on behind.Oh well, in general a decent read, except for the little bit extreme idea that all you need in econometrics is OLS and IV. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Great companion to a normal econometrics textbook. I used this in my second semester of econometrics and it was helpful to have explanations and a bit of a narrative in addition to just equations and proofs. Helps make good sense of the subject."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "This is the book of common prayer for econometrics. Although, to be honest, it's more useful than that.Seriously, this book is an actually funny to read book which clearly runs through a lot of important concepts in statistics for the social sciences."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "A nice reference book if you already have a decent background in the field. There are so many references to other parts of the book that it felt jumpy, but it's a pretty comprehensive guide to the tools used by applied microeconomists. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Defining a target audience for this book is difficult: It mixes conversational style with heavy derivations. The authors choice to frame all of their expositions in a less common framework does not help lowering the complexity.The derivations and difficult language, mixed in with some missing explanations and missing higher-level framing of the different topics make this book fairly unaccessible at an even with some level of knowledge in the area of (micro)econometrics, and should potentially be consumed together with a more textbook-style work, which explains the contents within the context.For more seasoned practitioners, the authors offer some interesting insights in interpretations of model estimates and potentially some (new?) ideas for model designs. The framing of the models in the conditional expectations framework may be insightful, but requires very close reading. But crucially, this book misses out on many more detailed mathematical/statistical/econometrical explanations. I can see that this book could be used as a starting point to dig deeper into one (or more) of the cited texts, or to reflect on some of the user's practices. The review by A. Gelman at https://doi.org/10.1177/1536867X09009... gives a more insight into more technical issues with the book.In addition to these, I found the style of writing and layout of the book difficult to follow, which is extremely dense in some areas and very wordy at others, which is a lot to digest when reading the book front-to-back. I do not think this book works good as a reference work either, due to interdependencies between chapters. (The authors seem to have been aware of this, there is some amount of repetition happening.)This book is only occasionally harmless, and lacks in some areas of its writing. You may be better off buying a \"proper\" textbook on microeconometrics, such as Wooldridge or Cameron."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "one of the only statistics books I recommend to people because it addresses real-world issues that impact whether real projects get funding or not. It's a question we'd like to get right.This is one of two books I can think of off the top of my head (Weisberg's is the other) which foregrounds _what_does_regression_actually_mean_. Versus the mathematical process.On the other hand, maybe statistical measures like lm beta and sd are nothing more than high-dimensional hypotenuse constructions. Most of what people want to know from lm questions could be answered by looking at random subsets of treatment group and non-treatment group, then drilling down with counter-questions that come from real world common sense.Using a concrete example from a random popular armchair bullshitter https://twitter.com/clairlemon/status..., people have various ideas about why divorced men might be less productive, and subgroups / extra data columns, if they're available, might be used to answer some of these real-world counter questions.If the gritty details of subscripts and high-dimensional hypotenuses weren't so focussed on, the time used to understand the minutiae of these arguments could instead be used to read the data collection methodology and variable definitions, which in my experience always swamp debates about what the algebra \"means\"."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Great book on econometrics but definitely NOT the first one you should read. There are useful and practical tips for practitioners. It provides a big picture on recent developlemnts in econometrics and empirical research focused on causal questions. I agree with other reviews that \"Mostly harmless\" in the title is quite painful reading with advanced formal notation. I recommend to start with Mastering 'Metrics: The Path from Cause to Effect or Causal Inference: The Mixtape for modern approach to econometrics, or with a standard texbook Introductory Econometrics. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "This highly technical book was a challenge for me to read because I am unpracticed in statistics. It is written with attention to data scientists who might utilize programming libraries to do the work than mathematics.Overall the consideration is on teasing out trends and being able to understand how to model and interpret data as it applies to economics. The majority of this book is about types of models. There is much discussion about the mathematical consequences for various models, but not much discussion about how to select models per data -- the examples are selected in order to align with the mathematics and not the other way around.I intend to read this again when I have a little more meat on my stats."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Definitely got catfished by the title/reviews. Was looking for a practical intro book and the first chapters were encouraging, but it rapidly went downhill in chapter 3 when they started proving properties of the conditional expectation function… I’m a simple boy. I want applicable results, not proofs. Will look around for something aimed at amateurs like me. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Good addition to a standard introductory text in econometrics, focuses mostly on microeconometrics, less on macroeconometrics and barely any financial econometrics. Basic undergraduate linear algebra, calculus and statistics are required. Contains a lot of real-world examples which help build a strong intuition for applied econometrics. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "The learning curve for this book is very deep. You would have a lot of trouble to understand it if you did not take Econometrics classes. But the good thing about the book is that the authors are able to explain the intuition very well. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "It gives an overview of the most useful tools for an applied economist, and offers caution for what not to do. Perhaps it is a good book to keep on hand to review when applying specific methods. One hope is if more recent editions can include more recent papers or code for replication."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "An authoritative view of econometric discipline from insiders. Definitely not meant for beginners, but more of a companion with a strong opinionated view of econometric should and should not be thus should be read with care."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Not really harmless, but one of the most useful resource books if you already have some backgrounds in econometrics. The real added value lies in the focus on causal inference. In the universe of causal Inference textbooks this is one of the bests."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Great book, but you need a certain exposure to graduate-level econometrics. My second time with this book, and it makes much more sense now! After suffering from grad metrics, it feels good to get a small grasp of widely used applied methods."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Hard read, but a valuable look at modern econometric techniques like differences in differences, discontinuity designs and quantile methods."
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Don’t let the title fool you this is a PhD level econometrics book. It’s a succinct supplementary book if you already know the concepts. "
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "quick and dirty survey of popular econometric methods. tremendously useful"
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "The most entertaining stats book in the world"
	},
	{
		"Title": "Mostly Harmless Econometrics : An Empiricist's Companion",
		"URL": "https://www.bookdepository.com/Mostly-Harmless-Econometrics-Joshua-Angrist/9780691120355?ref=grid-view&qid=1662452982903&sr=1-2",
		"Review": "Pretty technical. Shows how to use predictive analytics (scientific) techniques to address common policy and research questions. Best read alongside an actual textbook."
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Description": "This is the perfect (and essential) supplement for all econometrics classes--from a rigorous first undergraduate course, to a first master's, to a PhD course. Explains what is going on in textbooks full of proofs and formulas Offers intuition, skepticism, insights, humor, and practical advice (dos and don'ts) Contains new chapters that cover instrumental variables and computational considerations Includes additional information on GMM, nonparametrics, and an introduction to wavelets\n"
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "One of the best, and easy to use summary in statistics to check assumptions and ensure correct analysis. Statistics are more abused than used, which renders this book a superior reference against common-day abuses. "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "A very good treatment of what Econometrics is, in plain English. Use a good undergrad book, this and book like Goldberger to supplement your undoubtedly unreadable PhD level textbook. "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "Excellent book!"
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "A book such as this serves no purpose in this day and age when one can easily get terse summaries of different statistical and econometric techniques from Wikipedia. This book has an awful lot of words but very few examples of how to apply many of techniques in practice, so often it doesn't really help when you have a confusion that you're trying to clear up. If William Greene's Econometric Analysis is too mathematical, at least it has good examples of how to apply that math and sometimes the math can yield good intuition.This book certainly doesn't claim to be the most rigorous text and so I don't judge it as such, but it also provide very little value if what you seek is intuition. Better to skip it and find another book."
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "This is basically econometrics for dummies. If it's not in your bookshelf, then you can't call yourself an econometrician. "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "Great book - contains both the requisite technical material to understand applied regression and a whole wealth of valuable intuition. "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "The classic companion to any applied econometrics."
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "This is simply the best, most useful resource available for anyone who does any applied statistics of any kind. Highly reccomended."
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "One of the best Introductory Texts."
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "Gotta say, for a subject that I really struggle with, this was a great read. The author does a good job explaining things conceptually. This will be something I buy and keep for a reference! "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "I'd be much worse off without this book. "
	},
	{
		"Title": "A Guide to Econometrics",
		"URL": "https://www.bookdepository.com/Guide-Econometrics-Peter-Kennedy/9781405182577?ref=grid-view&qid=1662452982903&sr=1-3",
		"Review": "A good reference to get my arms around the intuitions of a variety of econometric methods."
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Description": "Score your highest in econometrics? Easy. Econometrics can prove challenging for many students unfamiliar with the terms and concepts discussed in a typical econometrics course. Econometrics For Dummies eliminates that confusion with easy-to-understand explanations of important topics in the study of economics. Econometrics For Dummies breaks down this complex subject and provides you with an easy-to-follow course supplement to further refine your understanding of how econometrics works and how it can be applied in real-world situations. * An excellent resource for anyone participating in a college or graduate level econometrics course * Provides you with an easy-to-follow introduction to the techniques and applications of econometrics * Helps you score high on exam day If you're seeking a degree in economics and looking for a plain-English guide to this often-intimidating course, Econometrics For Dummies has you covered.\n"
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Review": "This is a well written book on Econometrics. I have no background in Economics but do have a firm foundation in statistics and so found the book educational and understandable, broadening my understanding of how economists use data and think about proof. "
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Review": "Many folks hate the \"For Dummies\" series, for it tries sometimes too hard to simplify complex subjects and ultimately fails at doing so. But this book for me was really the opposite.At its foundation, Econometrics is a complex subject that should be treated with extreme care. Even if the empiricist turn in Economics might be a bit overrated given how empiricists are not deemed in regard as high as theoreticians, it is what unveils evidence that will back or contradict the field's foundations, and open new ways for it to engage in new areas of thought.I wouldn't recommend this book as anything other than something to consult when you really want to remind yourself of some very basic concepts in Econometrics that might have been long forgotten in your mind, if you're a veteran like me. But if I ever have to teach Econometrics to a bunch of first and/or second-year students at some institution where people still struggle with basic calculus and linear algebra, I wouldn't be opposed to the idea of using this book as a secondary reference to my peers. As there is certainly something to grasp from here that might be lost from the bunch of equations thrown at you by most of the classic Econometrics textbooks out there."
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Review": "Well explained, clear, not too technical, but just technical enough to show the concepts, great overview, simple style, great job yadda yadda...BUTWhat is it with American writers and sports examples?! And not normal sports either - but sports that no-one outside of the US cares about or understands. Why does every concept have to be illustrated with reference to baseball or American football? If I bought a book on sports science, I wouldn't expect examples using economic data, so why do it the other way round?? Rant over. Otherwise, top notch"
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Review": "Best $18 I ever spent--would have flunked econometrics without this. Added bonus, it has all the STATA commands in each chapter, which is great if you have a professor who uses STATA and assumes that you know how to use it too, even though this is your first class, and requires you to do all your homework in it...LIFESAVER!!!!"
	},
	{
		"Title": "Econometrics For Dummies",
		"URL": "https://www.bookdepository.com/Econometrics-For-Dummies-R-Pedace/9781118533840?ref=grid-view&qid=1662452982903&sr=1-4",
		"Review": "An extremely well written book that covers the basics of Econometrics and much more! I finally got to understand how to perform a logitic regression and I discovered some interesting concepts (such as the 'standardized regression coefficients'). I wish I had read this book sooner :)"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Description": "Gain an understanding of how econometrics can answer today's questions in business, policy evaluation and forecasting with Wooldridge's INTRODUCTORY ECONOMETRICS: A MODERN APPROACH, 7E. Unlike traditional texts, this book's practical, yet professional, approach demonstrates how econometrics has moved beyond a set of abstract tools to become genuinely useful for answering questions across a variety of disciplines.\n\n                            The author has organized the book's presentation around the type of data being analyzed with a systematic approach that only introduces assumptions as they are needed. This makes the material easier to understand and, ultimately, leads to better econometric practices. Packed with relevant applications, the text incorporates more than 100  data sets in different formats. Updates introduce the latest developments in the field, including the recent advances in the so-called \"causal effects\" or \"treatment effects,\" to provide a complete understanding of the impact and importance of econometrics today.\n"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Perfect introduction to econometrics. Very well written. It covers all relevant topics for an empirical research. You start as a novice and at the end you can perform serious research and understand the papers based on econometric approach. Few sub-chapters and may be chapters 17 and 18 are hard to follow but otherwise you can have a fun reading the textbook. I would highlight chapter 8 on heteroskedasticity, chapters 13 and 14 on pooled crossed section and panel data, or chapter 15 on Insturmetal variables. You can read them as a novel. You will want to read them through before going to bed and you will be tempted to start some empirical project asap. "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Having already read Stock and Watson's econometrics book, I do say that I found Wooldridge's simultaneously (1) more technical and challenging and (2) ultimately more useful, especially when working with the provided datasets (if you have R, go ahead and install the 'wooldridge' package when reading this book). Both books covered the same material more-or-less, but I guess it is a question of where your interests and prior knowledge of applied probability and statistics are at before taking a course in econometrics."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Dense and unapproachable in subject matter, sure, but also in style and presentation, which rendered this book impossible to learn from. Thanks, internet, for providing this information in clearer and cheaper fashion."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "This has been a widely used econometric textbook for a good reason. Econometrics can be a rather daunting subject to learn, but the author does a great job breaking down the seemingly complex formulae in a clear and succinct way coupled with well-chosen examples that help readers think through the underlying notions. I would no doubt strongly recommend this book to anyone who wants an accessible introduction to the subject."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Simply the best undergraduate econometrics textbook available. Formal treatment, complete coverage of most important topics, and some extra math for those inclined (in the appendices)."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "A great book for learning regression analysis, even for those whose topic is not related to economy (like me).I only read a section here and a few pages there, but this book helped me out a lot.It answered a lot of specific questions I had about dummy variables, dealing with heteroskedasticity and others. Some tests are explained in a nice step-by-step manner so that they are easily implementable if no code is available for the platform of your choice.I can absolutely recommend it."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Thoroughly enjoyed this textbook, which I read instead of going to lectures/ watching videos."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Now, THIS is the real textbook. Author really know what's up. I personally think it is well written in format (at least compared to PMBOK). Author provide the fundamental logic or assumption clearly for every approach. Don't understand the theoretical mathematics equation? Fine, juts look at the example and you will get better understanding. Framework for each chapter is also explained flawlessly. Of course for some reason people felt that content is definitely a bit dense. But hey, it's just like the other textbook. Other think is that, a basic knowledge of statistic would be advantageous before start reading this book since I think that statistic in the appendix is not sufficient to help someone new into this. I'm interested in knowing more about econometrics."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "The whole book is written in a clear and lucid language. Previously, I read Gujrati's book and became frustrated with econometrics. I got A in my graduate Econometrics course at USF using this book. Many of my confusions was cleared. Certainly , this is good for undegrad and masters, not suitable for PhD( as PhD requires more rigorous texts). Btw, plenty of examples to count. "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Hmm, i am going, to be honest, this class was boring so I never used this. Maybe 2 times for HW. lol. anywho the class was boring, so I would imagine the book is the same. Yes, I'm judging a book before i really read it. So what "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Must've read this mess three times now. Can't say that I had a good time. Nor that it was as straightforward as it could've been."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Knowledgeble!!!An important and valuable text book for those who want to learn the basics about Econometrics. Recommended for every economist. "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "This is my first review, only because I believe this book deserves every bit of acclaim. Very very good book! Anyone who wants to \"understand\" econometrics, go for this book. "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "To be honest, I didn't read all that much of this one. Hence no rating given. This is just for 'records', lol."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "This book is good for starters. Not so mathematical but more on intuition. If you've finished this already, it's time to level up haha!"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "This is truly an incredible book - especially the way how chapters are organized and presented. The narrative followed in this book makes everyone understands econometrics."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "I use this book instead of the required text my lecturer suggested, but it gives me more than I hope. Difficult definitions, formula, models are explained in detailed and clearly although Woolridge cancelled mostly rigorious proofs. However, my course focuses on practicing (applied econ) so it's still ok. :-) The appendix is pretty helpful to review statistical problems in comparison with its length. "
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "OK, I didn't actually read this one... :)"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "this book most help to study, and give me more trick... ^_^"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Legible, but rough on the eyes..."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Awesome!No need to look further, this is exactly what you need to make sense out of econometrics!"
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "This book was very confusing. I think some more illustrations and charts would have helped make some of the theoretical stuff easier to understand."
	},
	{
		"Title": "Introductory Econometrics : A Modern Approach",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Jeffrey-Wooldridge/9781337558860?ref=grid-view&qid=1662452982903&sr=1-5",
		"Review": "Very clear"
	},
	{
		"Title": "Econometric Analysis of Cross Section and Panel Data",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Cross-Section-Panel-Data-Jeffrey-M-Wooldridge/9780262232586?ref=grid-view&qid=1662452982903&sr=1-6",
		"Description": "The second edition of a comprehensive state-of-the-art graduate level text on microeconometric methods, substantially revised and updated.\n\n                            The second edition of this acclaimed graduate text provides a unified treatment of two methods used in contemporary econometric research, cross section and data panel methods. By focusing on assumptions that can be given behavioral content, the book maintains an appropriate level of rigor while emphasizing intuitive thinking. The analysis covers both linear and nonlinear models, including models with dynamics and/or individual heterogeneity. In addition to general estimation frameworks (particular methods of moments and maximum likelihood), specific linear and nonlinear methods are covered in detail, including probit and logit models and their multivariate, Tobit models, models for count data, censored and missing data schemes, causal (or treatment) effects, and duration analysis.\n\n                            Econometric Analysis of Cross Section and Panel Data was the first graduate econometrics text to focus on microeconomic data structures, allowing assumptions to be separated into population and sampling assumptions. This second edition has been substantially updated and revised. Improvements include a broader class of models for missing data problems; more detailed treatment of cluster problems, an important topic for empirical researchers; expanded discussion of generalized instrumental variables (GIV) estimation; new coverage (based on the author's own recent research) of inverse probability weighting; a more complete framework for estimating treatment effects with panel data, and a firmly established link between econometric approaches to nonlinear panel data and the generalized estimating equation literature popular in statistics and other fields. New attention is given to explaining when particular econometric methods can be applied; the goal is not only to tell readers what does work, but why certain obvious procedures do not. The numerous included exercises, both theoretical and computer-based, allow the reader to extend methods covered in the text and discover new insights.\n"
	},
	{
		"Title": "Econometric Analysis of Cross Section and Panel Data",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Cross-Section-Panel-Data-Jeffrey-M-Wooldridge/9780262232586?ref=grid-view&qid=1662452982903&sr=1-6",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introductory Econometrics for Finance",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-for-Finance-Chris-Brooks/9781108436823?ref=grid-view&qid=1662452982903&sr=1-7",
		"Description": "A complete resource for finance students, this textbook presents the most common empirical approaches in finance in a comprehensive and well-illustrated manner that shows how econometrics is used in practice, and includes detailed case studies to explain how the techniques are used in relevant financial contexts. Maintaining the accessible prose and clear examples of previous editions, the new edition of this best-selling textbook provides support for the main industry-standard software packages, expands the coverage of introductory mathematical and statistical techniques into two chapters for students without prior econometrics knowledge, and includes a new chapter on advanced methods. Learning outcomes, key concepts and end-of-chapter review questions (with full solutions online) highlight the main chapter takeaways and allow students to self-assess their understanding. Online resources include extensive teacher and student support materials, including EViews, Stata, R, and Python software guides.\n"
	},
	{
		"Title": "Introductory Econometrics for Finance",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-for-Finance-Chris-Brooks/9781108436823?ref=grid-view&qid=1662452982903&sr=1-7",
		"Review": "One of my favourite textbooks. It not only explains everything in details but also gives a guidance on usage of software package - Eviews. Can be used as a complete self-study guidance. Read the chapters needed for my quantitative methods class, but expecting to come back to that book soon when I have another econometrics related module. "
	},
	{
		"Title": "Introductory Econometrics for Finance",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-for-Finance-Chris-Brooks/9781108436823?ref=grid-view&qid=1662452982903&sr=1-7",
		"Review": "ultimate guidance for my final paper.."
	},
	{
		"Title": "Schaum's Outline of Statistics and Econometrics, Second Edition",
		"URL": "https://www.bookdepository.com/Schaums-Outline-Statistics-Econometrics-Second-Edition-Dominick-Salvatore/9780071755474?ref=grid-view&qid=1662452982903&sr=1-8",
		"Description": "The ideal review for your statistics and econometrics course\n\n                            More than 40 million students have trusted Schaum's Outlines for their expert knowledge and helpful solved problems. Written by renowned experts in their respective fields, Schaum's Outlines cover everything from math to science, nursing to language. The main feature for all these books is the solved problems. Step-by-step, authors walk readers through coming up with solutions to exercises in their topic of choice. \n\n\n\n                            Clear, concise explanations of all statistics and econometrics conceptsAppropriate for the following courses: Statistics and Econometrics, Statistical Methods in Economics, Quantitative Methods in Economics, Mathematical Economics, Micro-Economics, Macro-Economics, Math for Economists, Math for Social Sciences\n"
	},
	{
		"Title": "Schaum's Outline of Statistics and Econometrics, Second Edition",
		"URL": "https://www.bookdepository.com/Schaums-Outline-Statistics-Econometrics-Second-Edition-Dominick-Salvatore/9780071755474?ref=grid-view&qid=1662452982903&sr=1-8",
		"Review": "For the probability section, makes a fine (simpler) complement to Ross' 'A First Course in Probability'. Provides, as in Ross, many exercises but in a different style. The rest of the book is about regression including an interesting chapter on time series."
	},
	{
		"Title": "The Econometrics of Financial Markets",
		"URL": "https://www.bookdepository.com/Econometrics-Financial-Markets-John-Y-Campbell/9780691043012?ref=grid-view&qid=1662452982903&sr=1-9",
		"Description": "The past twenty years have seen an extraordinary growth in the use of quantitative methods in financial markets. Finance professionals now routinely use sophisticated statistical techniques in portfolio management, proprietary trading, risk management, financial consulting, and securities regulation. This graduate-level textbook is intended for PhD students, advanced MBA students, and industry professionals interested in the econometrics of financial modeling. The book covers the entire spectrum of empirical finance, including: the predictability of asset returns, tests of the Random Walk Hypothesis, the microstructure of securities markets, event analysis, the Capital Asset Pricing Model and the Arbitrage Pricing Theory, the term structure of interest rates, dynamic models of economic equilibrium, and nonlinear financial models such as ARCH, neural networks, statistical fractals, and chaos theory. Each chapter develops statistical techniques within the context of a particular financial application. This exciting new text contains a unique and accessible combination of theory and practice, bringing state-of-the-art statistical techniques to the forefront of financial applications.\n                            Each chapter also includes a discussion of recent empirical evidence, for example, the rejection of the Random Walk Hypothesis, as well as problems designed to help readers incorporate what they have read into their own applications\n"
	},
	{
		"Title": "The Econometrics of Financial Markets",
		"URL": "https://www.bookdepository.com/Econometrics-Financial-Markets-John-Y-Campbell/9780691043012?ref=grid-view&qid=1662452982903&sr=1-9",
		"Review": "A classic for empirical finance. Might be a bit outdated nowadays, but still good for the fundamentals."
	},
	{
		"Title": "The Econometrics of Financial Markets",
		"URL": "https://www.bookdepository.com/Econometrics-Financial-Markets-John-Y-Campbell/9780691043012?ref=grid-view&qid=1662452982903&sr=1-9",
		"Review": "Useful only for those who already know quite a bit of mathematics."
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Christopher-Dougherty/9780199676828?ref=grid-view&qid=1662452982903&sr=1-10",
		"Description": "Introduction to Econometrics provides students with clear and simple mathematics notation and step-by-step explanations of mathematical proofs, to give them a thorough understanding of the subject. Extensive exercises throughout build confidence by encouraging students to apply econometric techniques.\n\n                            Retaining its student-friendly approach, Introduction to Econometrics has a comprehensive revision guide to all the essential statistical concepts needed to study econometrics, additional Monte Carlo simulations, new summaries, and non-technical introductions to more advanced topics at the end of chapters.\n\n                            This book is supported by an Online Resource Centre, which includes:\n\n                            For lecturers:\n\n                            * Instructor's manual for the text and data sets, detailing the exercises and their solutions.\n                            * Customizable PowerPoint slides.\n\n                            For students:\n\n                            * Data sets referred to in the book.\n                            * A comprehensive study guide offers students the opportunity to gain experience with econometrics through practice with exercises.\n                            * Software manual.\n                            * PowerPoint slides with explanations.\n"
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Christopher-Dougherty/9780199676828?ref=grid-view&qid=1662452982903&sr=1-10",
		"Review": "Got to love textbook humour : \"Let us consider an even simpler example of a random variable, the number obtained when you throw just one die. (Pedantic note : this is the singular of the word whose plural is dice. Two dice, one die. Like two mice, one mie.)(Well, two mice, one mouse. Like two hice, one house. Peculiar language, English.)\""
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Badi-H-Baltagi/9783030801489?ref=grid-view&qid=1662452982903&sr=1-11",
		"Description": "This textbook teaches some of the basic econometric methods and the underlying assumptions behind them. It also includes a simple and concise treatment of more advanced topics in spatial correlation, panel data, limited dependent variables, regression diagnostics, specification testing and time series analysis. Each chapter has a set of theoretical exercises as well as empirical illustrations using real economic applications. These empirical exercises usually replicate a published article using Stata, Eviews as well as SAS.\n\n                            This new sixth edition has been fully revised and updated, and includes new material on limited dependent variables and panel data as well as revision of basic topics like heteroskedasticity, endogeneity, over-identification and specification testing. The author also provides more exercises and empirical examples based on published economic applications.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Badi-H-Baltagi/9783030801489?ref=grid-view&qid=1662452982903&sr=1-11",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics by Example",
		"URL": "https://www.bookdepository.com/Econometrics-by-Example-Damodar-Gujarati/9781137375018?ref=grid-view&qid=1662452982903&sr=1-12",
		"Description": "The second edition of this bestselling textbook retains its unique learning-by-doing approach to econometrics. Rather than relying on complex theoretical discussions and complicated mathematics, this book explains econometrics from a practical point of view by walking the student through real-life examples, step by step. Damodar Gujarati's clear, concise, writing style guides students from model formulation, to estimation and hypothesis-testing, through to post-estimation diagnostics. The basic statistics needed to follow the book are covered in an appendix, making the book a flexible and self-contained learning resource. \n\n                            The textbook is ideal for undergraduate students in economics, business, marketing, finance, operations research and related disciplines. It is also intended for students in MBA programs across the social sciences, and for researchers in business, government and research organizations who require econometrics.\n\n                            New to this Edition:\n                            - Two brand new chapters on Quantile Regression Modeling and Multivariate Regression Models.\n                            - Two further additional chapters on hierarchical linear regression models and bootstrapping are available on the book's website \n                            - New extended examples accompanied by real-life data \n                            - New student exercises at the end of each chapter\n\n                            Accompanying online resources for this title can be found at bloomsburyonlineresources.com/econometrics-by-example-2. These resources are designed to support teaching and learning when using this textbook and are available at no extra cost.\n"
	},
	{
		"Title": "Econometrics by Example",
		"URL": "https://www.bookdepository.com/Econometrics-by-Example-Damodar-Gujarati/9781137375018?ref=grid-view&qid=1662452982903&sr=1-12",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Description": "Learn more about modern Econometrics with this comprehensive introduction to the field, featuring engaging applications and bringing contemporary theories to life. Introduction to Econometrics, 4th Edition, Global Edition by Stock and Watson is the ultimate introductory guide that connects modern theory with motivating, engaging applications.\n\n                             The text ensures you get a solid grasp of this challenging subject's theoretical background, building on the philosophy that applications should drive the theory, not the other way around. The latest edition maintains the focus on currency, focusing on empirical analysis and incorporating real-world questions and data by using results directly relevant to the applications.\n\n                             The text contextualises the study of Econometrics with a comprehensive introduction and review of economics, data, and statistics before proceeding to an extensive regression analysis studying the different variables and regression parameters. With a large data set increasingly used in Economics and related fields, a new chapter dedicated to Big Data will help you learn more about this growing and exciting area.\n\n                             Sharing a variety of resources and tools to help your understanding and critical thinking of the topics introduced, such as General Interest boxes, or end-of-chapter, and empirical exercises and summaries, this industry-leading text will help you acquire a sophisticated knowledge of this fascinating subject.\n\n                             Reach every student by pairing this text with Pearson MyLab (R) Economics\n\n                             MyLab is the teaching and learning platform that empowers you to reach every student. By combining trusted author content with digital tools and a flexible platform, MyLab (R) personalises the learning experience and improves results for each student.\n\n                             If you would like to purchase both the physical text and MyLab Economics search for:\n\n                             9781292264561 Introduction to Econometrics, 4th Edition, Global Edition with MyLab Economics\n\n                             Package consists of:\n\n\n\n                              9781292264455 Introduction to Econometrics, 4th Edition, Global Edition\n                              9781292264516 Introduction to Econometrics, 4th Edition, Global Edition MyLab Economics\n                              9780136879787 Introduction to Econometrics, 4th Edition, Global Edition Pearson eText\n\n                             Pearson MyLab (R) Economics is not included. Students, if Pearson MyLab Economics is a recommended/mandatory component of the course, please ask your instructor for the correct ISBN. Pearson MyLab (R) Economics should only be purchased when required by an instructor. Instructors, contact your Pearson representative for more information.\n"
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "I'm going to wait to rate this until after I read Wooldridge's book. But my first thoughts are mostly positive."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "It's not good. If you already understand what's going on, it seems like a decent textbook, but Stock & Watson often lack clarity in their explanations. This book is 1) nearly impossible to skim because of the writing style 2) very bad in terms of making connections to other theories and applications and ideas 3) devoid of metaphor and 4) bad at concisely explaining equations. A good mathematical textbook gives you an important equation and then explains it for the next paragraph, telling you what all the variables mean, what happens if some of them change, what this means, etc. S&W often don't even tell you what variables mean, and you might have to go three pages back in the book to figure out that the variable p is supposed to stand for \"the number of lags.\" And the amount of times they say something like \"and we can prove this because it's just like equation (8.7),\" and then don't even mention what equation 8.7 is infuriating. They expect you to go back 200 pages to equation 8.7 (which, by the way, has no concise explanation, so you're going to need to read the five pages around equation 8.7 to figure out what it means). It's like reading a research paper that leaves page numbers without quotations--it treats me like I'm too stupid to do the thinking myself."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "This book is the best start to those who are intersted in the fields of econometrics. You need the fundamentals of statistics to get most out ou it."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "Although I've nothing to compare it against, the book lacks usability. Too much of the rendering of equations is written in block text rather than using any diagrams. There are other points where equations are re-render/substituted/expanded/simplified without explanation. One is left to figure out these leaps on his own. That's not instruction or elucidation. Typical academic fair whereby the author is too far removed from his audience (an introductory one) so that much is lost."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "This is a decent undergraduate econometrics textbook, but I think that \"Introductory Econometrics: A Modern Approach\" by Jeffrey Wooldridge is a much better choice for learning econometrics. For this book, the Introduction to Econometrics website provides some useful links and resources."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "This book is appropriate as a gentle introduction to econometrics (the application of statistical methods to economic theory). The book is well-written and the authors focus on insuring that the book does not fly over the heads of beginners. "
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "Stock's Introduction to Econometrics is probably the best undergrad text I've found on regression, explaining even some fairly advanced topics in an accessible way. I've used it extensively to try to understand some of the hairier concepts I've been dealing with in my first-year grad sequence."
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "People who have a knack for statistics tend to not have one for explaining statistics, but this book is one of the most accessible textbooks out there. Thorough but readable. "
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "it's a really great book for econometrics college course"
	},
	{
		"Title": "Introduction to Econometrics, Global Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Global-Edition-James-Stock/9781292264455?ref=grid-view&qid=1662452982903&sr=1-13",
		"Review": "I want to read this book"
	},
	{
		"Title": "Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Principles-Econometrics-R-Carter-Hill/9781119510567?ref=grid-view&qid=1662452982903&sr=1-14",
		"Description": "Principles of Econometrics, Fifth Edition, is an introductory book for undergraduate students in economics and finance, as well as first-year graduate students in a variety of fields that include economics, finance, accounting, marketing, public policy, sociology, law, and political science. Students will gain a working knowledge of basic econometrics so they can apply modeling, estimation, inference, and forecasting techniques when working with real-world economic problems. Readers will also gain an understanding of econometrics that allows them to critically evaluate the results of others' economic research and modeling, and that will serve as a foundation for further study of the field.\n\n                            This new edition of the highly-regarded econometrics text includes major revisions that both reorganize the content and present students with plentiful opportunities to practice what they have read in the form of chapter-end exercises.\n"
	},
	{
		"Title": "Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Principles-Econometrics-R-Carter-Hill/9781119510567?ref=grid-view&qid=1662452982903&sr=1-14",
		"Review": "Oldie but goodie"
	},
	{
		"Title": "Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Principles-Econometrics-R-Carter-Hill/9781119510567?ref=grid-view&qid=1662452982903&sr=1-14",
		"Review": "What a book! The author leaves no stone unturned here, even the most obscure forms of regression analysis get their own page. This book has a level of breadth and depth I've never witnessed from any Math book. As an introductory text this is no good but as a reference this is incredible. This one is a keeper."
	},
	{
		"Title": "Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Bayesian-Econometrics-Gary-Koop/9780470845677?ref=grid-view&qid=1662452982903&sr=1-15",
		"Description": "Researchers in many fields are increasingly finding the Bayesian approach to statistics to be an attractive one. This book introduces the reader to the use of Bayesian methods in the field of econometrics at the advanced undergraduate or graduate level. The book is self--contained and does not require that readers have previous training in econometrics. The focus is on models used by applied economists and the computational techniques necessary to implement Bayesian methods when doing empirical work. Topics covered in the book include the regression model (and variants applicable for use with panel data), time series models, models for qualitative or censored data, nonparametric methods and Bayesian model averaging. The book includes numerous empirical examples and the website associated with it contains data sets and computer programs to help the student develop the computational skills of modern Bayesian econometrics.\n"
	},
	{
		"Title": "Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Bayesian-Econometrics-Gary-Koop/9780470845677?ref=grid-view&qid=1662452982903&sr=1-15",
		"Review": "Good intro bayesian treatment if you're taking it with a good instructor. Also check out Alleby and Rossu. "
	},
	{
		"Title": "Using R for Introductory Econometrics",
		"URL": "https://www.bookdepository.com/Using-R-for-Introductory-Econometrics-Florian-Heiss/9781523285136?ref=grid-view&qid=1662452982903&sr=1-16",
		"Description": "Note that the second edition is now available. It seems like a good idea to get that instead..\n\n                             Introduces the popular, powerful and free programming language and software package R Focus: implementation of standard tools and methods used in econometrics Compatible with \"Introductory Econometrics\" by Jeffrey M. Wooldridge in terms of topics, organization, terminology and notation Companion website with full text, all code for download and other goodies\n\n\n\n                            Praise:  \"A very nice resource for those wanting to use R in their introductory econometrics courses.\" (Jeffrey M. Wooldridge) Using R for Introductory Econometrics is a fabulous modern resource. I know I'm going to be using it with my students, and I recommend it to anyone who wants to learn about econometrics and R at the same time.\" (David E. Giles in his blog \"Econometrics Beat\")\n\n\n\n                            Topics:  A gentle introduction to R Simple and multiple regression in matrix form and using black box routines Inference in small samples and asymptotics Monte Carlo simulations Heteroscedasticity Time series regression Pooled cross-sections and panel data Instrumental variables and two-stage least squares Simultaneous equation models Limited dependent variables: binary, count data, censoring, truncation, and sample selection Formatted reports and research papers combining R with R Markdown or LaTeX\n"
	},
	{
		"Title": "Using R for Introductory Econometrics",
		"URL": "https://www.bookdepository.com/Using-R-for-Introductory-Econometrics-Florian-Heiss/9781523285136?ref=grid-view&qid=1662452982903&sr=1-16",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Bruce-Hansen/9780691235899?ref=grid-view&qid=1662452982903&sr=1-17",
		"Description": "The most authoritative and up-to-date core econometrics textbook available\n\n                            Econometrics is the quantitative language of economic theory, analysis, and empirical work, and it has become a cornerstone of graduate economics programs. Econometrics provides graduate and PhD students with an essential introduction to this foundational subject in economics and serves as an invaluable reference for researchers and practitioners. This comprehensive textbook teaches fundamental concepts, emphasizes modern, real-world applications, and gives students an intuitive understanding of econometrics.\n\n\n\n\n                            Covers the full breadth of econometric theory and methods with mathematical rigor while emphasizing intuitive explanations that are accessible to students of all backgrounds\n                            Draws on integrated, research-level datasets, provided on an accompanying website\n                            Discusses linear econometrics, time series, panel data, nonparametric methods, nonlinear econometric models, and modern machine learning\n                            Features hundreds of exercises that enable students to learn by doing\n                            Includes in-depth appendices on matrix algebra and useful inequalities and a wealth of real-world examples\n                            Can serve as a core textbook for a first-year PhD course in econometrics and as a follow-up to Bruce E. Hansen's Probability and Statistics for Economists\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Bruce-Hansen/9780691235899?ref=grid-view&qid=1662452982903&sr=1-17",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Schaum's Outline of Statistics and Econometrics",
		"URL": "https://www.bookdepository.com/Schaums-Outline-Statistics-Econometrics-Dominick-Salvatore/9780071348522?ref=grid-view&qid=1662452982903&sr=1-18",
		"Description": "Tough Test Questions? Missed Lectures? Not Enough Time?\n\n                            Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills. \n\n                            This Schaum's Outline gives you\n\n\n\n                            Practice problems with full explanations that reinforce knowledgeCoverage of the most up-to-date developments in your course fieldIn-depth review of practices and applications\n                            Fully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scores!\n\n                            Schaum's Outlines-Problem Solved.\n"
	},
	{
		"Title": "Schaum's Outline of Statistics and Econometrics",
		"URL": "https://www.bookdepository.com/Schaums-Outline-Statistics-Econometrics-Dominick-Salvatore/9780071348522?ref=grid-view&qid=1662452982903&sr=1-18",
		"Review": "For the probability section, makes a fine (simpler) complement to Ross' 'A First Course in Probability'. Provides, as in Ross, many exercises but in a different style. The rest of the book is about regression including an interesting chapter on time series."
	},
	{
		"Title": "Introduction to Statistics and Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Statistics-Econometrics-Takeshi-Amemiya/9780674462250?ref=grid-view&qid=1662452982903&sr=1-19",
		"Description": "This outstanding text by a foremost econometrician combines instruction in probability and statistics with econometrics in a rigorous but relatively nontechnical manner. Unlike many statistics texts, it discusses regression analysis in depth. And unlike many econometrics texts, it offers a thorough treatment of statistics. Although its only mathematical requirement is multivariate calculus, it challenges the student to think deeply about basic concepts.\n\n                            The coverage of probability and statistics includes best prediction and best linear prediction, the joint distribution of a continuous and discrete random variable, large sample theory, and the properties of the maximum likelihood estimator. Exercises at the end of each chapter reinforce the many illustrative examples and diagrams. Believing that students should acquire the habit of questioning conventional statistical techniques, Takeshi Amemiya discusses the problem of choosing estimators and compares various criteria for ranking them. He also evaluates classical hypothesis testing critically, giving the realistic case of testing a composite null against a composite alternative. He frequently adopts a Bayesian approach because it provides a useful pedagogical framework for discussing many fundamental issues in statistical inference.\n\n                            Turning to regression, Amemiya presents the classical bivariate model in the conventional summation notation. He follows with a brief introduction to matrix analysis and multiple regression in matrix notation. Finally, he describes various generalizations of the classical regression model and certain other statistical models extensively used in econometrics and other applications in social science.\n"
	},
	{
		"Title": "Introduction to Statistics and Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Statistics-Econometrics-Takeshi-Amemiya/9780674462250?ref=grid-view&qid=1662452982903&sr=1-19",
		"Review": "The best intro probability, statistics and econometrics. Clean, concise and emphasizes the fundamentals."
	},
	{
		"Title": "Introductory Econometrics: Asia Pacific Edition with Online Study Tools 12 months",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Asia-Pacific-Edition-with-Online-Study-Tools-12-months-Jeffrey-M-Wooldridge/9780170350839?ref=grid-view&qid=1662452982903&sr=1-20",
		"Description": "Econometrics is the combined study of economics and statistics and is an 'applied' unit. It is increasingly becoming a core element in finance degrees at upper levels.\n\n                            This first local adaptation of Wooldridge's text offers a version of Introductory Econometrics with a structural redesign that will better suit the market along with Asia-Pacific examples and data. Two new chapters at the start of the book have been developed from material originally in Wooldridge's appendix section to serve as a clear introduction to the subject and as a revision tool that bridges students' transition from basic statistics into econometrics. \n\n                            This adaptation includes data sets from Australian and New Zealand, as well as from the Asia-Pacific region to suit the significant portion of finance students who are from Asia and the likelihood that many graduates will find employment overseas.\n"
	},
	{
		"Title": "Introductory Econometrics: Asia Pacific Edition with Online Study Tools 12 months",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Asia-Pacific-Edition-with-Online-Study-Tools-12-months-Jeffrey-M-Wooldridge/9780170350839?ref=grid-view&qid=1662452982903&sr=1-20",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Description": "This title has been adapted for use in Europe, the Middle East and Africa and has been tailored to meet the demands of today's lecturers and students.\n\n                            Jeffrey M. Wooldridge's Introduction to Econometrics shows how econometrics is a useful tool for answering questions in business, policy evaluation and forecasting environments. Packed with timely, relevant applications, the text incorporates close to 100 intriguing data sets, available in six formats, with appendices and questions available online.\n\n                            Unique organization pioneered by the author clearly presents applications for today's students. This comprehensive econometrics text pioneered the approach of explicitly covering cross-sectional applications first, followed by time series applications, and, ultimately, panel data applications in the advanced chapters.\n\n                            Practical application prepares students to use econometrics in business today. This unique, comprehensive text applies econometrics to actual real business problems, demonstrating how each method answers a particular issue facing researchers who are analyzing non-experimental data.\n"
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Perfect introduction to econometrics. Very well written. It covers all relevant topics for an empirical research. You start as a novice and at the end you can perform serious research and understand the papers based on econometric approach. Few sub-chapters and may be chapters 17 and 18 are hard to follow but otherwise you can have a fun reading the textbook. I would highlight chapter 8 on heteroskedasticity, chapters 13 and 14 on pooled crossed section and panel data, or chapter 15 on Insturmetal variables. You can read them as a novel. You will want to read them through before going to bed and you will be tempted to start some empirical project asap. "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Having already read Stock and Watson's econometrics book, I do say that I found Wooldridge's simultaneously (1) more technical and challenging and (2) ultimately more useful, especially when working with the provided datasets (if you have R, go ahead and install the 'wooldridge' package when reading this book). Both books covered the same material more-or-less, but I guess it is a question of where your interests and prior knowledge of applied probability and statistics are at before taking a course in econometrics."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Dense and unapproachable in subject matter, sure, but also in style and presentation, which rendered this book impossible to learn from. Thanks, internet, for providing this information in clearer and cheaper fashion."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "This has been a widely used econometric textbook for a good reason. Econometrics can be a rather daunting subject to learn, but the author does a great job breaking down the seemingly complex formulae in a clear and succinct way coupled with well-chosen examples that help readers think through the underlying notions. I would no doubt strongly recommend this book to anyone who wants an accessible introduction to the subject."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Simply the best undergraduate econometrics textbook available. Formal treatment, complete coverage of most important topics, and some extra math for those inclined (in the appendices)."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "A great book for learning regression analysis, even for those whose topic is not related to economy (like me).I only read a section here and a few pages there, but this book helped me out a lot.It answered a lot of specific questions I had about dummy variables, dealing with heteroskedasticity and others. Some tests are explained in a nice step-by-step manner so that they are easily implementable if no code is available for the platform of your choice.I can absolutely recommend it."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Thoroughly enjoyed this textbook, which I read instead of going to lectures/ watching videos."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Now, THIS is the real textbook. Author really know what's up. I personally think it is well written in format (at least compared to PMBOK). Author provide the fundamental logic or assumption clearly for every approach. Don't understand the theoretical mathematics equation? Fine, juts look at the example and you will get better understanding. Framework for each chapter is also explained flawlessly. Of course for some reason people felt that content is definitely a bit dense. But hey, it's just like the other textbook. Other think is that, a basic knowledge of statistic would be advantageous before start reading this book since I think that statistic in the appendix is not sufficient to help someone new into this. I'm interested in knowing more about econometrics."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "The whole book is written in a clear and lucid language. Previously, I read Gujrati's book and became frustrated with econometrics. I got A in my graduate Econometrics course at USF using this book. Many of my confusions was cleared. Certainly , this is good for undegrad and masters, not suitable for PhD( as PhD requires more rigorous texts). Btw, plenty of examples to count. "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Hmm, i am going, to be honest, this class was boring so I never used this. Maybe 2 times for HW. lol. anywho the class was boring, so I would imagine the book is the same. Yes, I'm judging a book before i really read it. So what "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Must've read this mess three times now. Can't say that I had a good time. Nor that it was as straightforward as it could've been."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Knowledgeble!!!An important and valuable text book for those who want to learn the basics about Econometrics. Recommended for every economist. "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "This is my first review, only because I believe this book deserves every bit of acclaim. Very very good book! Anyone who wants to \"understand\" econometrics, go for this book. "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "To be honest, I didn't read all that much of this one. Hence no rating given. This is just for 'records', lol."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "This book is good for starters. Not so mathematical but more on intuition. If you've finished this already, it's time to level up haha!"
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "This is truly an incredible book - especially the way how chapters are organized and presented. The narrative followed in this book makes everyone understands econometrics."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "I use this book instead of the required text my lecturer suggested, but it gives me more than I hope. Difficult definitions, formula, models are explained in detailed and clearly although Woolridge cancelled mostly rigorious proofs. However, my course focuses on practicing (applied econ) so it's still ok. :-) The appendix is pretty helpful to review statistical problems in comparison with its length. "
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "OK, I didn't actually read this one... :)"
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "this book most help to study, and give me more trick... ^_^"
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Legible, but rough on the eyes..."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Awesome!No need to look further, this is exactly what you need to make sense out of econometrics!"
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "This book was very confusing. I think some more illustrations and charts would have helped make some of the theoretical stuff easier to understand."
	},
	{
		"Title": "Introduction to Econometrics : EMEA Edition",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Jeffrey-Wooldridge/9781408093757?ref=grid-view&qid=1662452982903&sr=1-21",
		"Review": "Very clear"
	},
	{
		"Title": "Applied Econometrics with R",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-with-R-Christian-Kleiber/9780387773162?ref=grid-view&qid=1662452982903&sr=1-22",
		"Description": "R is a language and environment for data analysis and graphics. It may be considered an implementation of S, an award-winning language initially - veloped at Bell Laboratories since the late 1970s. The R project was initiated by Robert Gentleman and Ross Ihaka at the University of Auckland, New Zealand, in the early 1990s, and has been developed by an international team since mid-1997. Historically, econometricians have favored other computing environments, some of which have fallen by the wayside, and also a variety of packages with canned routines. We believe that R has great potential in econometrics, both for research and for teaching. There are at least three reasons for this: (1) R is mostly platform independent and runs on Microsoft Windows, the Mac family of operating systems, and various ?avors of Unix/Linux, and also on some more exotic platforms. (2) R is free software that can be downloaded and installed at no cost from a family of mirror sites around the globe, the Comprehensive R Archive Network (CRAN); hence students can easily install it on their own machines. (3) R is open-source software, so that the full source code is available and can be inspected to understand what it really does, learn from it, and modify and extend it. We also like to think that platform independence and the open-source philosophy make R an ideal environment for reproducible econometric research.\n"
	},
	{
		"Title": "Applied Econometrics with R",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-with-R-Christian-Kleiber/9780387773162?ref=grid-view&qid=1662452982903&sr=1-22",
		"Review": "Good basic treatment of a number of topics (especially linear regression and Sweave), but in some of the later chapters it became painfully apparent that this is, as advertised, a graduate-level text. Unless you're a statistician or an economist, a lot of content will sail over your head, as it assumes you're already familiar with the statistical tests being discussed, why you'd want to do them, and what the results mean.At the end, I decided it was time to head back and do a really thorough reading of Venables and Ripley's classic Modern Applied Statistics with S."
	},
	{
		"Title": "Applied Econometrics with R",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-with-R-Christian-Kleiber/9780387773162?ref=grid-view&qid=1662452982903&sr=1-22",
		"Review": "An easy to read, easy to follow, practical guide to R learners with econometric orientation. It explains the basic econometric analysis briefly followed by practical hands-on exercises. "
	},
	{
		"Title": "Using Python for Introductory Econometrics",
		"URL": "https://www.bookdepository.com/Using-Python-for-Introductory-Econometrics-Daniel-Brunner/9798648436763?ref=grid-view&qid=1662452982903&sr=1-23",
		"Description": "Introduces the popular, powerful and free programming language and software package Python Focus: implementation of standard tools and methods used in econometrics Compatible with \"Introductory Econometrics\" by Jeffrey M. Wooldridge in terms of topics, organization, terminology and notation Companion website with full text, all code for download and other goodies\n\n                            Topics:  A gentle introduction to Python Simple and multiple regression in matrix form and using black box routines Inference in small samples and asymptotics Monte Carlo simulations Heteroscedasticity Time series regression Pooled cross-sections and panel data Instrumental variables and two-stage least squares Simultaneous equation models Limited dependent variables: binary, count data, censoring, truncation, and sample selection Formatted reports using Jupyter Notebooks\n"
	},
	{
		"Title": "Using Python for Introductory Econometrics",
		"URL": "https://www.bookdepository.com/Using-Python-for-Introductory-Econometrics-Daniel-Brunner/9798648436763?ref=grid-view&qid=1662452982903&sr=1-23",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "A Guide to Modern Econometrics 5th Edition",
		"URL": "https://www.bookdepository.com/Guide-Modern-Econometrics-5th-Edition-M-Verbeek/9781119472117?ref=grid-view&qid=1662452982903&sr=1-25",
		"Description": "A Guide to Modern Econometrics, Fifth Edition has become established as a highly successful textbook. It serves as a guide to alternative techniques in econometrics with an emphasis on intuition and the practical implementation of these approaches. This fifth edition builds upon the success of its predecessors. The text has been carefully checked and updated, taking into account recent developments and insights. It includes new material on casual inference, the use and limitation of p-values, instrumental variables estimation and its implementation, regression discontinuity design, standardized coefficients, and the presentation of estimation results.\n"
	},
	{
		"Title": "A Guide to Modern Econometrics 5th Edition",
		"URL": "https://www.bookdepository.com/Guide-Modern-Econometrics-5th-Edition-M-Verbeek/9781119472117?ref=grid-view&qid=1662452982903&sr=1-25",
		"Review": "Econometrics final project complete! On to multivariate statistics for next quarter!"
	},
	{
		"Title": "Applied Econometrics for Health Economists : A Practical Guide",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-for-Health-Economists-Andrew-Jones/9781846191718?ref=grid-view&qid=1662452982903&sr=1-26",
		"Description": "\"Applied Econometrics for Health Economists\" introduces readers to the appropriate econometric techniques for use with different forms of survey data, known collectively as microeconometrics. The book provides a complete illustration of the steps involved in doing microeconometric research. The only study to deal with practical analysis of qualitative and categorical variables, it also emphasises applied work, illustrating the use of relevant computer software applied to large-scale survey datasets. This is a comprehensive reference guide - it contains a glossary of terms, a technical appendix, software appendix, references, and suggestions for further reading. It is concise and easy to read - technical details are avoided in the main text and key terms are highlighted. It is essential reading for health economists as well as undergraduate and postgraduate students of health economics. \"Given the extensive use of individual-level survey data in health economics, it is important to understand the econometric techniques available to applied researchers. Moreover, it is just as important to be aware of their limitations and pitfalls. The purpose of this book is to introduce readers to the appropriate econometric techniques for use with different forms of survey data - known collectively as microeconometrics.\" - Andrew Jones, in the Preface.\n"
	},
	{
		"Title": "Applied Econometrics for Health Economists : A Practical Guide",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-for-Health-Economists-Andrew-Jones/9781846191718?ref=grid-view&qid=1662452982903&sr=1-26",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Nonparametric Econometrics : Theory and Practice",
		"URL": "https://www.bookdepository.com/Nonparametric-Econometrics-Qi-Li/9780691121611?ref=grid-view&qid=1662452982903&sr=1-27",
		"Description": "Until now, students and researchers in nonparametric and semiparametric statistics and econometrics have had to turn to the latest journal articles to keep pace with these emerging methods of economic analysis. Nonparametric Econometrics fills a major gap by gathering together the most up-to-date theory and techniques and presenting them in a remarkably straightforward and accessible format. The empirical tests, data, and exercises included in this textbook help make it the ideal introduction for graduate students and an indispensable resource for researchers. Nonparametric and semiparametric methods have attracted a great deal of attention from statisticians in recent decades. While the majority of existing books on the subject operate from the presumption that the underlying data is strictly continuous in nature, more often than not social scientists deal with categorical data--nominal and ordinal--in applied settings. The conventional nonparametric approach to dealing with the presence of discrete variables is acknowledged to be unsatisfactory. This book is tailored to the needs of applied econometricians and social scientists.\n                            Qi Li and Jeffrey Racine emphasize nonparametric techniques suited to the rich array of data types--continuous, nominal, and ordinal--within one coherent framework. They also emphasize the properties of nonparametric estimators in the presence of potentially irrelevant variables. Nonparametric Econometrics covers all the material necessary to understand and apply nonparametric methods for real-world problems.\n"
	},
	{
		"Title": "Nonparametric Econometrics : Theory and Practice",
		"URL": "https://www.bookdepository.com/Nonparametric-Econometrics-Qi-Li/9780691121611?ref=grid-view&qid=1662452982903&sr=1-27",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introduction to Modern Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Modern-Bayesian-Econometrics-Tony-Lancaster/9781405117203?ref=grid-view&qid=1662452982903&sr=1-28",
		"Description": "In this new and expanding area, Tony Lancaster's text is the first comprehensive introduction to the Bayesian way of doing applied economics. * Uses clear explanations and practical illustrations and problems to present innovative, computer--intensive ways for applied economists to use the Bayesian method;  * Emphasizes computation and the study of probability distributions by computer sampling;  * Covers all the standard econometric models, including linear and non--linear regression using cross--sectional, time series, and panel data;  * Details causal inference and inference about structural econometric models;  * Includes numerical and graphical examples in each chapter, demonstrating their solutions using the S programming language and Bugs software  * Supported by online supplements, including Data Sets and Solutions to Problems, at www.blackwellpublishing.com/lancaster\n"
	},
	{
		"Title": "Introduction to Modern Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Modern-Bayesian-Econometrics-Tony-Lancaster/9781405117203?ref=grid-view&qid=1662452982903&sr=1-28",
		"Review": "Good for advanced PhDs in econometrics. Not a great book on its own. "
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Samuel-Cameron/9780077104283?ref=grid-view&qid=1662452982903&sr=1-29",
		"Description": "Econometrics aims to introduce students with little or no previous experience in econometrics to this important discipline. This text focuses on explaining why econometrics exists and how it can be used in everyday life. This text adopts a strong student-focused approach to the discipline. In doing so, it aims to address fundamental issues in econometrics in an accessible manner for students, who are often put off by the difficult nature of econometrics.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Samuel-Cameron/9780077104283?ref=grid-view&qid=1662452982903&sr=1-29",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Applied Time Series Econometrics",
		"URL": "https://www.bookdepository.com/Applied-Time-Series-Econometrics-Helmut-Lutkepohl/9780521547871?ref=grid-view&qid=1662452982903&sr=1-30",
		"Description": "Time series econometrics is a rapidly evolving field. Particularly, the cointegration revolution has had a substantial impact on applied analysis. Hence, no textbook has managed to cover the full range of methods in current use and explain how to proceed in applied domains. This gap in the literature motivates the present volume. The methods are sketched out, reminding the reader of the ideas underlying them and giving sufficient background for empirical work. The treatment can also be used as a textbook for a course on applied time series econometrics. Topics include: unit root and cointegration analysis, structural vector autoregressions, conditional heteroskedasticity and nonlinear and nonparametric time series models. Crucial to empirical work is the software that is available for analysis. New methodology is typically only gradually incorporated into existing software packages. Therefore a flexible Java interface has been created, allowing readers to replicate the applications and conduct their own analyses.\n"
	},
	{
		"Title": "Applied Time Series Econometrics",
		"URL": "https://www.bookdepository.com/Applied-Time-Series-Econometrics-Helmut-Lutkepohl/9780521547871?ref=grid-view&qid=1662452982903&sr=1-30",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Description": "For first-year graduate courses in Econometrics for Social Scientists. \n\n                             Bridging the gap between social science studies and econometric analysis \n\n                             Designed to bridge the gap between social science studies and field-econometrics, Econometric Analysis, 8th Edition, Global Edition, presents this ever-growing area at an accessible graduate level. The book first introduces students to basic techniques, a rich variety of models, and underlying theory that is easy to put into practice. It then presents students with a sufficient theoretical background to understand advanced techniques and to recognise new variants of established models. This focus, along with hundreds of worked numerical examples, ensures that students can apply the theory to real-world application and are prepared to be successful economists in the field.\n"
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "A great reference book, a horrible teaching/learning book. "
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "The style of the text is a little too talky for my tastes and uses that dumb \"case-study\" format that business majors seem to love. But after wading far enough through the mist he eventually gets to the important mathematical theory and explains it fairly well."
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "I hope could be more interested in Greene's storytelling."
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Reading this as non economics major or a graduating student can be really challenging. It is a challenging read like most college textbooks. The mathematical notations used become more difficult to keep track of as you go deeper into the book, this and the complexity of the subject was the reason i couldn't follow much towards the later half. Still its a good textbook that can be used as a reference, at least i know what page to turn to if i ever encounter a similar problem in future. "
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Used this textbook for three semesters in my Econ Ph.D. program. It is not a friendly read, nor particularly well-organized. But it is a nice references to many, many obscure topics. And it makes attempts to be relevant and provide examples."
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "He tends to be too abstract at times"
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Great econometrics text book"
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "never mentally recovered from it"
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Good!"
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Not so friendly but a nice guide to the theory of implemented econometrics."
	},
	{
		"Title": "Econometric Analysis, Global Edition",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Global-Edition-William-Greene/9781292231136?ref=grid-view&qid=1662453154352&sr=1-32",
		"Review": "Still use it everyday. "
	},
	{
		"Title": "A Course in Econometrics",
		"URL": "https://www.bookdepository.com/Course-Econometrics-Arthur-S-Goldberger/9780674175440?ref=grid-view&qid=1662453154352&sr=1-33",
		"Description": "This text prepares first-year graduate students and advanced undergraduates for empirical research in economics, and also equips them for specialization in econometric theory, business, and sociology.\n\n                            A Course in Econometrics is likely to be the text most thoroughly attuned to the needs of your students. Derived from the course taught by Arthur S. Goldberger at the University of Wisconsin-Madison and at Stanford University, it is specifically designed for use over two semesters, offers students the most thorough grounding in introductory statistical inference, and offers a substantial amount of interpretive material. The text brims with insights, strikes a balance between rigor and intuition, and provokes students to form their own critical opinions.\n\n                            A Course in Econometrics thoroughly covers the fundamentals-classical regression and simultaneous equations-and offers clear and logical explorations of asymptotic theory and nonlinear regression. To accommodate students with various levels of preparation, the text opens with a thorough review of statistical concepts and methods, then proceeds to the regression model and its variants. Bold subheadings introduce and highlight key concepts throughout each chapter.\n\n                            Each chapter concludes with a set of exercises specifically designed to reinforce and extend the material covered. Many of the exercises include real microdata analyses, and all are ideally suited to use as homework and test questions.\n"
	},
	{
		"Title": "A Course in Econometrics",
		"URL": "https://www.bookdepository.com/Course-Econometrics-Arthur-S-Goldberger/9780674175440?ref=grid-view&qid=1662453154352&sr=1-33",
		"Review": "The best way to learn econometrics. The scales fell from my eyes after reading this. Clearly separates identification and estimation. Most econometrics texts jumble these two things together to confuse the hell out of everybody. Somebody please write an updated textbook that takes this approach!"
	},
	{
		"Title": "A Course in Econometrics",
		"URL": "https://www.bookdepository.com/Course-Econometrics-Arthur-S-Goldberger/9780674175440?ref=grid-view&qid=1662453154352&sr=1-33",
		"Review": "Goldberger was my econometrics professor in graduate school. His lectures were remarkably lucid, as is his text (which allowed me to retire my dog-eared lecture notes)."
	},
	{
		"Title": "A Primer in Econometric Theory",
		"URL": "https://www.bookdepository.com/Primer-Econometric-Theory-John-Stachurski/9780262034906?ref=grid-view&qid=1662453154352&sr=1-34",
		"Description": "A concise treatment of modern econometrics and statistics, including underlying ideas from linear algebra, probability theory, and computer programming.\n\n                            This book offers a cogent and concise treatment of econometric theory and methods along with the underlying ideas from statistics, probability theory, and linear algebra. It emphasizes foundations and general principles, but also features many solved exercises, worked examples, and code listings. After mastering the material presented, readers will be ready to take on more advanced work in different areas of quantitative economics and to understand papers from the econometrics literature. The book can be used in graduate-level courses on foundational aspects of econometrics or on fundamental statistical principles. It will also be a valuable reference for independent study.\n\n                            One distinctive aspect of the text is its integration of traditional topics from statistics and econometrics with modern ideas from data science and machine learning; readers will encounter ideas that are driving the current development of statistics and increasingly filtering into econometric methodology. The text treats programming not only as a way to work with data but also as a technique for building intuition via simulation. Many proofs are followed by a simulation that shows the theory in action. As a primer, the book offers readers an entry point into the field, allowing them to see econometrics as a whole rather than as a profusion of apparently unrelated ideas.\n"
	},
	{
		"Title": "A Primer in Econometric Theory",
		"URL": "https://www.bookdepository.com/Primer-Econometric-Theory-John-Stachurski/9780262034906?ref=grid-view&qid=1662453154352&sr=1-34",
		"Review": "Some sections have some okay explanations but in general I would not use this book to teach statistics. I'm not a big fan of the scatterings of R code and there's too much theory with not enough detail. I would have wanted a few more proofs of important theorems to be contained. The main problem is that there is almost no intuition, it's like he just going throught motions just for the sake of it. "
	},
	{
		"Title": "An Introduction to Mathematical Analysis for Economic Theory and Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Mathematical-Analysis-for-Economic-Theory-Econometrics-Dean-Corbae/9780691118673?ref=grid-view&qid=1662453154352&sr=1-35",
		"Description": "Providing an introduction to mathematical analysis as it applies to economic theory and econometrics, this book bridges the gap that has separated the teaching of basic mathematics for economics and the increasingly advanced mathematics demanded in economics research today. Dean Corbae, Maxwell B. Stinchcombe, and Juraj Zeman equip students with the knowledge of real and functional analysis and measure theory they need to read and do research in economic and econometric theory. Unlike other mathematics textbooks for economics, An Introduction to Mathematical Analysis for Economic Theory and Econometrics takes a unified approach to understanding basic and advanced spaces through the application of the Metric Completion Theorem. This is the concept by which, for example, the real numbers complete the rational numbers and measure spaces complete fields of measurable sets. Another of the book's unique features is its concentration on the mathematical foundations of econometrics. To illustrate difficult concepts, the authors use simple examples drawn from economic theory and econometrics.\n                            Accessible and rigorous, the book is self-contained, providing proofs of theorems and assuming only an undergraduate background in calculus and linear algebra. * Begins with mathematical analysis and economic examples accessible to advanced undergraduates in order to build intuition for more complex analysis used by graduate students and researchers  * Takes a unified approach to understanding basic and advanced spaces of numbers through application of the Metric Completion Theorem  * Focuses on examples from econometrics to explain topics in measure theory\n"
	},
	{
		"Title": "An Introduction to Mathematical Analysis for Economic Theory and Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Mathematical-Analysis-for-Economic-Theory-Econometrics-Dean-Corbae/9780691118673?ref=grid-view&qid=1662453154352&sr=1-35",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introductory Econometrics : Using Monte Carlo Simulation with Microsoft Excel",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Humberto-Barreto/9780521843195?ref=grid-view&qid=1662453154352&sr=1-36",
		"Description": "This highly accessible and innovative text with supporting web site uses Excel (R) to teach the core concepts of econometrics without advanced mathematics. It enables students to use Monte Carlo simulations in order to understand the data generating process and sampling distribution. Intelligent repetition of concrete examples effectively conveys the properties of the ordinary least squares (OLS) estimator and the nature of heteroskedasticity and autocorrelation. Coverage includes omitted variables, binary response models, basic time series, and simultaneous equations. The authors teach students how to construct their own real-world data sets drawn from the internet, which they can analyze with Excel (R) or with other econometric software. The accompanying web site with text support can be found at www.wabash.edu/econometrics.\n"
	},
	{
		"Title": "Introductory Econometrics : Using Monte Carlo Simulation with Microsoft Excel",
		"URL": "https://www.bookdepository.com/Introductory-Econometrics-Humberto-Barreto/9780521843195?ref=grid-view&qid=1662453154352&sr=1-36",
		"Review": "Interactive Guide to UNDERSTANDING econometrics: When I was a new graduate student I ended up buying several different econometrics texts. No one text had the best explanation for each topic. The problem remained that for many topics I never did find a book which translated the formal mathematical presentation into a practical worked out example, so that I could understand the procedure and how to implement it.  This book and accompanying CD-ROM does that and much more.  Every topic includes guided Microsoft Excel spreadsheets and add-ins which illustrate the topic being addressed. The text clearly explains not only the HOW, but the WHY. The economics and the econometrics are presented with such clarity and unity; bridging the two in a way that none of the other texts do.  In Barreto and Howlands book/CD package you interact with the data and the graphs (they include a superior add-in for creating histograms), and run Monte Carlo simulations to see the behavior of the estimators in repeated sampling. These are \"live\" spreadsheets that invite you to experiment. For example; there is an Excel workbook which illustrates the correlation coefficient. Rather than a dry recitation of formula and proof, you can interact with the spreadsheet and see exactly how the same coefficient can apply to data having very different patterns. It is one thing to see an illustration, and quite another to actually be the one creating the diagram, simply by running the macros and changing parameters. This \"hands on\" approach is so vital to actually getting an understanding of the material. I have only a basic understanding of Excel, and have had no difficulties in using the workbooks.  While the limits of Excel are pointed out by the authors, it is important to note the reason for using Excel. It is widely understood and available; there is no learning curve. By using Excel there is no software barrier between the student and understanding the principles of econometric modelling. In less than 1/2 hour I took the data and example of a Probit model using Maximum Likelihood estimation from a course web site from across the country and replicated the results using the add-in provided. Most of that time was used to extract the data from a .pdf file and get it formatted properly for Excel. Once I had the data in Excel, it took less than 2 minutes to run the Probit estimation (my first time using that add-in!) By the way, the results using the authors add-in for solving Probit models with ML estimation were the same as the results from GAUSS code to do the same. The add-in had a distinct advantage though in that a choice for Probit or Logit model estimation using either Non Linear Least Squares or the Maximum Likelihood estimation was just a radio button away! This text can complement any course, regardless of the software used.  Again, the beauty of the book is that you are not just left with Greek formulas that leave you wondering how to do the computations, and you are not left with computer output leaving you to wonder how to interpret that output. The text explains the meaning so powerfully that you are not only armed with an understanding which is useful for success in your course work, but also for applying the quantitative tools in real world analysis and applications. The text is like going to see your favorite professor who is sitting there with you one on one, giving you insight which only comes from experience.  I've been through courses that use Greene, and Judge, as well as introductory texts. This text stands alone in making use of the computing power we have at our disposal today, not to produce more computer printouts, but rather to increase our understanding--providing the sound reasoning for applying that power.  I should add that even after two years of statistics and econometrics I learned quite a lot from the statistics review chapters. Don't be misled by the \"Introductory\" title. I had learned and executed Artificial Neural Network models in graduate courses, but still learned a lot from the section on correlation in this book. For undergrad students this book will put you on the right path. For grad students it will correct blind spots and misconceptions.  I highly recommend this book/CD package to any econometrics student and to practicing analysts that use regression analysis. The authors have created a product that I wish I had when I was in school, but am glad I found now for applying in my career.  Detailed info on contents as well as the Excel files and add-ins are available from the authors' web site which I found prior to ordering from Amazon. Once I tried the workbooks, I knew I wanted the book. It's 800 pages of solid information and inspired teaching.  http://www.wabash.edu/econometrics/in..."
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-G-S-Maddala/9780470015124?ref=grid-view&qid=1662453154352&sr=1-37",
		"Description": "Now in its fourth edition, this landmark text provides a fresh, accessible and well-written introduction to the subject. With a rigorous pedagogical framework, which sets it apart from comparable texts, the latest edition features an expanded website providing numerous real life data sets and examples.\n"
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-G-S-Maddala/9780470015124?ref=grid-view&qid=1662453154352&sr=1-37",
		"Review": "GOOD BOOK FOR START WITH ECONOMATRICS"
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-G-S-Maddala/9780470015124?ref=grid-view&qid=1662453154352&sr=1-37",
		"Review": "https://www.goodreads.com/book/show/7...#"
	},
	{
		"Title": "Econometric Methods with Applications in Business and Economics",
		"URL": "https://www.bookdepository.com/Econometric-Methods-with-Applications-Business-Economics-Christiaan-Heij/9780199268016?ref=grid-view&qid=1662453154352&sr=1-38",
		"Description": "Nowadays applied work in business and economics requires a solid understanding of econometric methods to support decision-making. Combining a solid exposition of econometric methods with an application-oriented approach, this rigorous textbook provides students with a working understanding and hands-on experience of current econometrics.\n\n                            Taking a 'learning by doing' approach, it covers basic econometric methods (statistics, simple and multiple regression, nonlinear regression, maximum likelihood, and generalized method of moments), and addresses the creative process of model building with due attention to diagnostic testing and model improvement. Its last part is devoted to two major application areas: the econometrics of choice data (logit and probit, multinomial and ordered choice, truncated and censored data, and duration\n                            data) and the econometrics of time series data (univariate time series, trends, volatility, vector autoregressions, and a brief discussion of SUR models, panel data, and simultaneous equations).\n\n                            * Real-world text examples and practical exercise questions stimulate active learning and show how econometrics can solve practical questions in modern business and economic management.\n\n                            * Focuses on the core of econometrics, regression, and covers two major advanced topics, choice data with applications in marketing and micro-economics, and time series data with applications in finance and macro-economics.\n\n                            * Learning-support features include concise, manageable sections of text, frequent cross-references to related and background material, summaries, computational schemes, keyword lists, suggested further reading, exercise sets, and online data sets and solutions.\n\n                            * Derivations and theory exercises are clearly marked for students in advanced courses.\n\n                            This textbook is perfect for advanced undergraduate students, new graduate students, and applied researchers in econometrics, business, and economics, and for researchers in other fields that draw on modern applied econometrics.\n"
	},
	{
		"Title": "Econometric Methods with Applications in Business and Economics",
		"URL": "https://www.bookdepository.com/Econometric-Methods-with-Applications-Business-Economics-Christiaan-Heij/9780199268016?ref=grid-view&qid=1662453154352&sr=1-38",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Financial Econometric Modeling",
		"URL": "https://www.bookdepository.com/Financial-Econometric-Modeling-Stan-Hurn/9780190857066?ref=grid-view&qid=1662453154352&sr=1-39",
		"Description": "Financial econometrics brings financial theory and econometric methods together with the power of data to advance understanding of the global financial universe upon which all modern economies depend. Financial Econometric Modeling is an introductory text that meets the learning challenge of integrating theory, measurement, data, and software to understand the modern world of finance. Empirical applications with financial data play a central position in this\n                            book's exposition. Each chapter is a how-to guide that takes readers from ideas and theories through to the practical realities of modeling, interpreting, and forecasting financial data. The book reaches out to a wide audience of students, applied researchers, and industry practitioners, guiding readers of\n                            diverse backgrounds on the models, methods, and empirical practice of modern financial econometrics.\n\n                            Financial Econometric Modeling delivers a self-contained first course in financial econometrics, providing foundational ideas from financial theory and relevant econometric technique. From this foundation, the book covers a vast arena of modern financial econometrics that opens up empirical applications with data of the many different types that are now generated in financial markets. Every chapter follows the same principle ensuring that all results reported in the book may be\n                            reproduced using standard econometric software packages such as Stata or EViews, with a full set of data and programs provided to ensure easy implementation.\n"
	},
	{
		"Title": "Financial Econometric Modeling",
		"URL": "https://www.bookdepository.com/Financial-Econometric-Modeling-Stan-Hurn/9780190857066?ref=grid-view&qid=1662453154352&sr=1-39",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Time Series and Panel Data Econometrics",
		"URL": "https://www.bookdepository.com/Time-Series-Panel-Data-Econometrics-M-Hashem-Pesaran/9780198759980?ref=grid-view&qid=1662453154352&sr=1-40",
		"Description": "This book is concerned with recent developments in time series and panel data techniques for the analysis of macroeconomic and financial data. It provides a rigorous, nevertheless user-friendly, account of the time series techniques dealing with univariate and multivariate time series models, as well as panel data models.\n\n                            It is distinct from other time series texts in the sense that it also covers panel data models and attempts at a more coherent integration of time series, multivariate analysis, and panel data models. It builds on the author's extensive research in the areas of time series and panel data analysis and covers a wide variety of topics in one volume. Different parts of the book can be used as teaching material for a variety of courses in econometrics. It can also be used as reference manual.\n\n                            It begins with an overview of basic econometric and statistical techniques, and provides an account of stochastic processes, univariate and multivariate time series, tests for unit roots, cointegration, impulse response analysis, autoregressive conditional heteroskedasticity models, simultaneous equation models, vector autoregressions, causality, forecasting, multivariate volatility models, panel data models, aggregation and global vector autoregressive models (GVAR). The techniques are\n                            illustrated using Microfit 5 (Pesaran and Pesaran, 2009, OUP) with applications to real output, inflation, interest rates, exchange rates, and stock prices.\n"
	},
	{
		"Title": "Time Series and Panel Data Econometrics",
		"URL": "https://www.bookdepository.com/Time-Series-Panel-Data-Econometrics-M-Hashem-Pesaran/9780198759980?ref=grid-view&qid=1662453154352&sr=1-40",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Modern Spatial Econometrics in Practice : A Guide to GeoDa, GeoDaSpace and PySAL",
		"URL": "https://www.bookdepository.com/Modern-Spatial-Econometrics-Practice-Sergio-J-Rey/9780986342103?ref=grid-view&qid=1662453154352&sr=1-41",
		"Description": "This book is the definitive user's guide to the spatial regression functionality in the software packages GeoDa and GeoDaSpace, as well as the spreg module in the PySAL library --all developed at the GeoDa Center for Geospatial Analysis and Computation. The book provides the techniques to test for and estimate spatial effects in linear regression models, addressing both spatial dependence (spatial autoregressive models) as well as spatial heterogeneity (spatial regimes models). The book also serves as an introduction and a practical guide to spatial econometrics in that it covers the methodological principles and formal results that underlie the various estimation methods, test procedures and model characteristics computed by the software. While the classical maximum likelihood estimation is included, the book's coverage emphasizes modern techniques based on the principle of generalized method of moments (GMM).\n"
	},
	{
		"Title": "Modern Spatial Econometrics in Practice : A Guide to GeoDa, GeoDaSpace and PySAL",
		"URL": "https://www.bookdepository.com/Modern-Spatial-Econometrics-Practice-Sergio-J-Rey/9780986342103?ref=grid-view&qid=1662453154352&sr=1-41",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Financial Econometrics : Models and Methods",
		"URL": "https://www.bookdepository.com/Financial-Econometrics-Oliver-Linton/9781316630334?ref=grid-view&qid=1662453154352&sr=1-42",
		"Description": "This is a thorough exploration of the models and methods of financial econometrics by one of the world's leading financial econometricians and is for students in economics, finance, statistics, mathematics, and engineering who are interested in financial applications. Based on courses taught around the world, the up-to-date content covers developments in econometrics and finance over the last twenty years while ensuring a solid grounding in the fundamental principles of the field. Care has been taken to link theory and application to provide real-world context for students. Worked exercises and empirical examples have also been included to make sure complicated concepts are solidly explained and understood.\n"
	},
	{
		"Title": "Financial Econometrics : Models and Methods",
		"URL": "https://www.bookdepository.com/Financial-Econometrics-Oliver-Linton/9781316630334?ref=grid-view&qid=1662453154352&sr=1-42",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometric Modelling with Time Series : Specification, Estimation and Testing",
		"URL": "https://www.bookdepository.com/Econometric-Modelling-with-Time-Series-Vance-Martin/9780521139816?ref=grid-view&qid=1662453154352&sr=1-44",
		"Description": "This book provides a general framework for specifying, estimating and testing time series econometric models. Special emphasis is given to estimation by maximum likelihood, but other methods are also discussed, including quasi-maximum likelihood estimation, generalised method of moments estimation, nonparametric estimation and estimation by simulation. An important advantage of adopting the principle of maximum likelihood as the unifying framework for the book is that many of the estimators and test statistics proposed in econometrics can be derived within a likelihood framework, thereby providing a coherent vehicle for understanding their properties and interrelationships. In contrast to many existing econometric textbooks, which deal mainly with the theoretical properties of estimators and test statistics through a theorem-proof presentation, this book squarely addresses implementation to provide direct conduits between the theory and applied work.\n"
	},
	{
		"Title": "Econometric Modelling with Time Series : Specification, Estimation and Testing",
		"URL": "https://www.bookdepository.com/Econometric-Modelling-with-Time-Series-Vance-Martin/9780521139816?ref=grid-view&qid=1662453154352&sr=1-44",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometric Theory and Methods : International Edition",
		"URL": "https://www.bookdepository.com/Econometric-Theory-Methods-Russell-Davidson/9780195391053?ref=grid-view&qid=1662453154352&sr=1-45",
		"Description": "Econometric Theory and Methods International Edition provides a unified treatment of modern econometric theory and practical econometric methods. The geometrical approach to least squares is emphasized, as is the method of moments, which is used to motivate a wide variety of estimators and tests. Simulation methods, including the bootstrap, are introduced early and used extensively.    \n\n                            The book deals with a large number of modern topics. In addition to bootstrap and Monte Carlo tests, these include sandwich covariance matrix estimators, artificial regressions, estimating functions and the generalized method of moments, indirect inference, and kernel estimation. Every chapter incorporates numerous exercises, some theoretical, some empirical, and many involving simulation.\n"
	},
	{
		"Title": "Econometric Theory and Methods : International Edition",
		"URL": "https://www.bookdepository.com/Econometric-Theory-Methods-Russell-Davidson/9780195391053?ref=grid-view&qid=1662453154352&sr=1-45",
		"Review": "Before reading this textbook, I was effectively lost in the middle of many econometric methods that I could not connect together. In addition to that, my weak background in theoretical mathematics stood as a barrier to understanding econometric theory taught at my university.This textbook is self-contained and assumes no mathematical knowledge beyond calculus, basic linear algebra and statistics. All mathematical methods that are needed are introduced within chapters in a very intuitive way. The book starts from the basics of econometric theory and progresses to derive and prove common methods used at PhD level. This is done with a rich discussion that leaves little space for confusion.The book helped me develop my understanding such that I am now able to navigate different methods according to the problem at hand and assumptions that could be made. For example, it helped me have an intuitive understanding of what the weighting matrix should be for the feasible efficient GMM that I could always remember.I would recommend reading all chapters of the book as they contain a common theme and draw a natural line of progression to help understand how everything connects together."
	},
	{
		"Title": "Econometric Theory and Methods : International Edition",
		"URL": "https://www.bookdepository.com/Econometric-Theory-Methods-Russell-Davidson/9780195391053?ref=grid-view&qid=1662453154352&sr=1-45",
		"Review": "it was a hard book to read, especially regarding my not economics background. but after a while, I get used to the language and understanding. "
	},
	{
		"Title": "Econometric Theory and Methods : International Edition",
		"URL": "https://www.bookdepository.com/Econometric-Theory-Methods-Russell-Davidson/9780195391053?ref=grid-view&qid=1662453154352&sr=1-45",
		"Review": "Great book! I read it during my MA "
	},
	{
		"Title": "Econometric Theory and Methods : International Edition",
		"URL": "https://www.bookdepository.com/Econometric-Theory-Methods-Russell-Davidson/9780195391053?ref=grid-view&qid=1662453154352&sr=1-45",
		"Review": "no applications (that I recall) but very worthwhile piece in your artillery"
	},
	{
		"Title": "Introduction to Spatial Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Spatial-Econometrics-James-LeSage/9781420064247?ref=grid-view&qid=1662453154352&sr=1-46",
		"Description": "Although interest in spatial regression models has surged in recent years, a comprehensive, up-to-date text on these approaches does not exist. Filling this void, Introduction to Spatial Econometrics presents a variety of regression methods used to analyze spatial data samples that violate the traditional assumption of independence between observations. It explores a wide range of alternative topics, including maximum likelihood and Bayesian estimation, various types of spatial regression specifications, and applied modeling situations involving different circumstances.\n\n                            Leaders in this field, the authors clarify the often-mystifying phenomenon of simultaneous spatial dependence. By presenting new methods, they help with the interpretation of spatial regression models, especially ones that include spatial lags of the dependent variable. The authors also examine the relationship between spatiotemporal processes and long-run equilibrium states that are characterized by simultaneous spatial dependence. MATLAB (R) toolboxes useful for spatial econometric estimation are available on the authors' websites.\n\n                            This work covers spatial econometric modeling as well as numerous applied illustrations of the methods. It encompasses many recent advances in spatial econometric models-including some previously unpublished results.\n"
	},
	{
		"Title": "Introduction to Spatial Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Spatial-Econometrics-James-LeSage/9781420064247?ref=grid-view&qid=1662453154352&sr=1-46",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Principles of Econometrics : An Introduction (Using R)",
		"URL": "https://www.bookdepository.com/Principles-Econometrics-Neeraj-R-Hatekar/9788132104698?ref=grid-view&qid=1662453154352&sr=1-47",
		"Description": "This textbook makes learning the basic principles of econometrics easy for undergraduate and postgraduate students of economics. It specifically caters to the syllabus of 'Introductory Econometrics' course taught in the third year of the Bachelor of Economics programme in many universities.\n\n                              Principles of Econometrics takes the readers step-by-step from introduction to understanding, first introducing the basic statistical tools like concepts of probability, statistical distributions and hypothesis tests, and then going on to explain the two variable linear regression models along with certain additional tools such as the use of dummy variables and various data transformations. The most innovative feature of this textbook is that it familiarizes students with the role of R, which is a flexible and popular programming language. Using R, students will be able to implement a linear regression model and deal with the associated problems with substantial confidence.\n"
	},
	{
		"Title": "Principles of Econometrics : An Introduction (Using R)",
		"URL": "https://www.bookdepository.com/Principles-Econometrics-Neeraj-R-Hatekar/9788132104698?ref=grid-view&qid=1662453154352&sr=1-47",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Market Risk Analysis : Practical Financial Econometrics",
		"URL": "https://www.bookdepository.com/Market-Risk-Analysis-Carol-Alexander/9780470998014?ref=grid-view&qid=1662453154352&sr=1-48",
		"Description": "Written by leading market risk academic, Professor Carol Alexander, Practical Financial Econometrics forms part two of the Market Risk Analysis four volume set. It introduces the econometric techniques that are commonly applied to finance with a critical and selective exposition, emphasising the areas of econometrics, such as GARCH, cointegration and copulas that are required for resolving problems in market risk analysis. The book covers material for a one-semester graduate course in applied financial econometrics in a very pedagogical fashion as each time a concept is introduced an empirical example is given, and whenever possible this is illustrated with an Excel spreadsheet.  All together, the Market Risk Analysis four volume set illustrates virtually every concept or formula with a practical, numerical example or a longer, empirical case study. Across all four volumes there are approximately 300 numerical and empirical examples, 400 graphs and figures and 30 case studies many of which are contained in interactive Excel spreadsheets available from the the accompanying CD-ROM .\n                            Empirical examples and case studies specific to this volume include:* Factor analysis with orthogonal regressions and using principal component factors;* Estimation of symmetric and asymmetric, normal and Student t GARCH and E-GARCH parameters;* Normal, Student t, Gumbel, Clayton, normal mixture copula densities, and simulations from these copulas with application to VaR and portfolio optimization;* Principal component analysis of yield curves with applications to portfolio immunization and asset/liability management;* Simulation of normal mixture and Markov switching GARCH returns;* Cointegration based index tracking and pairs trading, with error correction and impulse response modelling;* Markov switching regression models (Eviews code);* GARCH term structure forecasting with volatility targeting;* Non-linear quantile regressions with applications to hedging.\n"
	},
	{
		"Title": "Market Risk Analysis : Practical Financial Econometrics",
		"URL": "https://www.bookdepository.com/Market-Risk-Analysis-Carol-Alexander/9780470998014?ref=grid-view&qid=1662453154352&sr=1-48",
		"Review": "Go-to reference book."
	},
	{
		"Title": "Market Risk Analysis : Practical Financial Econometrics",
		"URL": "https://www.bookdepository.com/Market-Risk-Analysis-Carol-Alexander/9780470998014?ref=grid-view&qid=1662453154352&sr=1-48",
		"Review": "As the first volume it covers everything from more practical perspective than any other books."
	},
	{
		"Title": "Student's Solutions Manual and Supplementary Materials for Econometric Analysis of Cross Section and Panel Data",
		"URL": "https://www.bookdepository.com/Students-Solutions-Manual-Supplementary-Materials-for-Econometric-Analysis-Cross-Section-Panel-Data-Jeffrey-M-Wooldridge/9780262731836?ref=grid-view&qid=1662453154352&sr=1-49",
		"Description": "This is the essential companion to the second edition of Jeffrey Wooldridge's widely used graduate econometrics text. The text provides an intuitive but rigorous treatment of two state-of-the-art methods used in contemporary microeconomic research. The numerous end-of-chapter exercises are an important component of the book, encouraging the student to use and extend the analytic methods presented in the book. This manual contains advice for answering selected problems, new examples, and supplementary materials designed by the author, which work together to enhance the benefits of the text. Users of the textbook will find the manual a necessary adjunct to the book.\n"
	},
	{
		"Title": "Student's Solutions Manual and Supplementary Materials for Econometric Analysis of Cross Section and Panel Data",
		"URL": "https://www.bookdepository.com/Students-Solutions-Manual-Supplementary-Materials-for-Econometric-Analysis-Cross-Section-Panel-Data-Jeffrey-M-Wooldridge/9780262731836?ref=grid-view&qid=1662453154352&sr=1-49",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Introduction to the Mathematical and Statistical Foundations of Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Mathematical-Statistical-Foundations-Econometrics-Herman-J-Bierens/9780521542241?ref=grid-view&qid=1662453154352&sr=1-50",
		"Description": "This book is intended for use in a rigorous introductory PhD level course in econometrics, or in a field course in econometric theory. It covers the measure-theoretical foundation of probability theory, the multivariate normal distribution with its application to classical linear regression analysis, various laws of large numbers, central limit theorems and related results for independent random variables as well as for stationary time series, with applications to asymptotic inference of M-estimators, and maximum likelihood theory. Some chapters have their own appendices containing the more advanced topics and/or difficult proofs. Moreover, there are three appendices with material that is supposed to be known. Appendix I contains a comprehensive review of linear algebra, including all the proofs. Appendix II reviews a variety of mathematical topics and concepts that are used throughout the main text, and Appendix III reviews complex analysis. Therefore, this book is uniquely self-contained.\n"
	},
	{
		"Title": "Introduction to the Mathematical and Statistical Foundations of Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Mathematical-Statistical-Foundations-Econometrics-Herman-J-Bierens/9780521542241?ref=grid-view&qid=1662453154352&sr=1-50",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "High-Frequency Financial Econometrics",
		"URL": "https://www.bookdepository.com/High-Frequency-Financial-Econometrics-Yacine-Ait-Sahalia/9780691161433?ref=grid-view&qid=1662453154352&sr=1-51",
		"Description": "High-frequency trading is an algorithm-based computerized trading practice that allows firms to trade stocks in milliseconds. Over the last fifteen years, the use of statistical and econometric methods for analyzing high-frequency financial data has grown exponentially. This growth has been driven by the increasing availability of such data, the technological advancements that make high-frequency trading strategies possible, and the need of practitioners to analyze these data. This comprehensive book introduces readers to these emerging methods and tools of analysis.  Yacine Ait-Sahalia and Jean Jacod cover the mathematical foundations of stochastic processes, describe the primary characteristics of high-frequency financial data, and present the asymptotic concepts that their analysis relies on. Ait-Sahalia and Jacod also deal with estimation of the volatility portion of the model, including methods that are robust to market microstructure noise, and address estimation and testing questions involving the jump part of the model.\n                            As they demonstrate, the practical importance and relevance of jumps in financial data are universally recognized, but only recently have econometric methods become available to rigorously analyze jump processes.  Ait-Sahalia and Jacod approach high-frequency econometrics with a distinct focus on the financial side of matters while maintaining technical rigor, which makes this book invaluable to researchers and practitioners alike.\n"
	},
	{
		"Title": "High-Frequency Financial Econometrics",
		"URL": "https://www.bookdepository.com/High-Frequency-Financial-Econometrics-Yacine-Ait-Sahalia/9780691161433?ref=grid-view&qid=1662453154352&sr=1-51",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Applied Nonparametric Econometrics",
		"URL": "https://www.bookdepository.com/Applied-Nonparametric-Econometrics-Daniel-J-Henderson/9780521279680?ref=grid-view&qid=1662453154352&sr=1-52",
		"Description": "The majority of empirical research in economics ignores the potential benefits of nonparametric methods, while the majority of advances in nonparametric theory ignore the problems faced in applied econometrics. This book helps bridge this gap between applied economists and theoretical nonparametric econometricians. It discusses in depth, and in terms that someone with only one year of graduate econometrics can understand, basic to advanced nonparametric methods. The analysis starts with density estimation and motivates the procedures through methods that should be familiar to the reader. It then moves on to kernel regression, estimation with discrete data, and advanced methods such as estimation with panel data and instrumental variables models. The book pays close attention to the issues that arise with programming, computing speed, and application. In each chapter, the methods discussed are applied to actual data, paying attention to presentation of results and potential pitfalls.\n"
	},
	{
		"Title": "Applied Nonparametric Econometrics",
		"URL": "https://www.bookdepository.com/Applied-Nonparametric-Econometrics-Daniel-J-Henderson/9780521279680?ref=grid-view&qid=1662453154352&sr=1-52",
		"Review": "Excellent book.It provides a very detailed review of non-parametric analysis, with emphasis on kernel type regressions methodologies.While it has a fair among of econometric theory through the text, it puts more emphasis on the empirical applications. Specially good if used with the R code they provide in their website.A must have for the applied econometrician."
	},
	{
		"Title": "Panel Data Econometrics with R",
		"URL": "https://www.bookdepository.com/Panel-Data-Econometrics-with-R-Y-Croissant/9781118949160?ref=grid-view&qid=1662453154352&sr=1-53",
		"Description": "Panel Data Econometrics with R provides a tutorial for using R in the field of panel data econometrics. Illustrated throughout with examples in econometrics, political science, agriculture and epidemiology, this book presents classic methodology and applications as well as more advanced topics and recent developments in this field including error component models, spatial panels and dynamic models. They have developed the software programming in R and host replicable material on the book s accompanying website.\n"
	},
	{
		"Title": "Panel Data Econometrics with R",
		"URL": "https://www.bookdepository.com/Panel-Data-Econometrics-with-R-Y-Croissant/9781118949160?ref=grid-view&qid=1662453154352&sr=1-53",
		"Review": "Some useful considerations and snippets of code, but too much math."
	},
	{
		"Title": "Using R for Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Using-R-for-Principles-Econometrics-Constantin-Colonescu/9781983486562?ref=grid-view&qid=1662453154352&sr=1-54",
		"Description": "R is an open source, free statistics software. 'Using R for Principles of Econometrics' provides R code solutions for most of the examples in the undergraduate Econometrics textbook 'Principles of Econometrics' by Hill, Griffiths, and Lim, fifth edition. However, 'Using R' is a self-contained work; it includes brief theory summaries for each chapter and all necessary information for understanding the solved examples. In addition, 'Using R' comes with a freely downloadable R data package that facilitates the use of the 'Principles of Econometrics' textbook data. No previous knowledge of R or Econometrics is necessary for understanding the content of 'Using R, ' but some knowledge in elementary statistics would help\n"
	},
	{
		"Title": "Using R for Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Using-R-for-Principles-Econometrics-Constantin-Colonescu/9781983486562?ref=grid-view&qid=1662453154352&sr=1-54",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "The Elements of Financial Econometrics",
		"URL": "https://www.bookdepository.com/Elements-Financial-Econometrics-Jianqing-Fan/9781107191174?ref=grid-view&qid=1662453154352&sr=1-55",
		"Description": "Financial econometrics is an interdisciplinary subject that uses statistical methods and economic theory to address a variety of quantitative problems in finance. This compact, master's-level textbook focuses on methodology and includes real financial data illustrations throughout. The mathematical level is purposely kept moderate, allowing the power of the quantitative methods to be understood without too much technical detail. Wherever possible, the authors indicate where to find the relevant R codes to implement the various methods. This book grew out of a course at Princeton University which is one of the world's flagship programs in computational finance and financial engineering. It will therefore be useful for those with an economics and finance background who are looking to sharpen their quantitative skills, and also for those with strong quantitative skills who want to learn how to apply them to finance.\n"
	},
	{
		"Title": "The Elements of Financial Econometrics",
		"URL": "https://www.bookdepository.com/Elements-Financial-Econometrics-Jianqing-Fan/9781107191174?ref=grid-view&qid=1662453154352&sr=1-55",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "A Companion to Econometric Analysis of Panel Data",
		"URL": "https://www.bookdepository.com/Companion-Econometric-Analysis-Panel-Data-Badi-H-Baltagi/9780470744031?ref=grid-view&qid=1662453154352&sr=1-56",
		"Description": "This book is a companion to Baltagi's (2008) leading graduate econometrics textbook on panel data entitled  Econometric Analysis of Panel Data, 4 th  Edition.  The book guides the student of panel data econometrics by solving exercises in a logical and pedagogical manner, helping the reader understand, learn and apply panel data methods. It is also a helpful tool for those who like to learn by solving exercises and running software to replicate empirical studies. It works as a complementary study guide to Baltagi (2008) and also as a stand alone book that builds up the reader's confidence in working out difficult exercises in panel data econometrics and applying these methods to empirical work. The exercises start by providing some background information on partitioned regressions and the Frisch-Waugh-Lovell theorem. Then it goes through the basic material on fixed and random effects models in a one-way and two-way error components models: basic estimation, test of hypotheses and prediction. This include maximum likelihood estimation, testing for poolability of the data, testing for the significance of individual and time effects, as well as Hausman's test for correlated effects.\n                            It also provides extensions of panel data techniques to serial correlation, spatial correlation, heteroskedasticity, seemingly unrelated regressions, simultaneous equations, dynamic panel models, incomplete panels, measurement error, count panels, rotating panels, limited dependent variables, and non-stationary panels. The book provides several empirical examples that are useful to applied researchers, illustrating them using Stata and EViews showing the reader how to replicate these studies. The  data sets  are provided on the Wiley web site:  www.wileyeurope.com/college/baltagi .\n"
	},
	{
		"Title": "A Companion to Econometric Analysis of Panel Data",
		"URL": "https://www.bookdepository.com/Companion-Econometric-Analysis-Panel-Data-Badi-H-Baltagi/9780470744031?ref=grid-view&qid=1662453154352&sr=1-56",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Description": "Applied Econometric Time Series, 4th Edition demonstrates modern techniques for developing models capable of forecasting, interpreting, and testing hypotheses concerning economic data. In this text, Dr. Walter Enders commits to using a learn-by-doing approach to help readers master time-series analysis efficiently and effectively.\n"
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Review": "investigation for class to the econometric finances"
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Review": "A good reference book for PhD level time series Econometrics. For more theoretical studies Hurn's \"Econometric Modeling\" is suggested. "
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Review": "A decent book, not to hard, but you have to be fairly good with advanced algebra. I used it for a Masters Level class on Time Series Economics. "
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Review": "A nice largely non-rigourous introduction that I have retained as a reference. "
	},
	{
		"Title": "Applied Econometric Times Series 4e",
		"URL": "https://www.bookdepository.com/Applied-Econometric-Times-Series-4e-W-Enders/9781118808566?ref=grid-view&qid=1662453154352&sr=1-57",
		"Review": "A very well illustrated test book indeed. "
	},
	{
		"Title": "Experimetrics : Econometrics for Experimental Economics",
		"URL": "https://www.bookdepository.com/Experimetrics-Peter-Moffatt/9780230250239?ref=grid-view&qid=1662453154352&sr=1-58",
		"Description": "This advanced textbook is an essential guide to discovering new and more illuminating ways to analyse the econometric modelling of experimental data. Peter Moffatt, one of the world's experts in the field, covers a range of techniques: from the familiar, such as treatment testing, to lesser known ones such as finite mixture models and the method of maximum simulated likelihood. The book takes a hands-on approach by explaining STATA commands in detail. In addition, difficult problems inherent in the methodology are addressed, such as the parametric estimation of social preference models, quantal response models, and learning models.\n\n                             An indispensable book for researchers and advanced students in experimental and behavioural economics who want to come to grips with the field of Experimetrics.\n\n                            The companion website www.palgrave.com/moffatt contains:\n                            - All data sets (in Stata format) used as examples in the book\n                            - An executable Stata 'do-file' containing stata commands and programs used in examples\n\n                            And\n                            - An Excel file containing some Excel calculations presented in the text\n"
	},
	{
		"Title": "Experimetrics : Econometrics for Experimental Economics",
		"URL": "https://www.bookdepository.com/Experimetrics-Peter-Moffatt/9780230250239?ref=grid-view&qid=1662453154352&sr=1-58",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Advanced Econometrics",
		"URL": "https://www.bookdepository.com/Advanced-Econometrics-Takeshi-Amemiya/9780674005600?ref=grid-view&qid=1662453154352&sr=1-59",
		"Description": "Advanced Econometrics is both a comprehensive text for graduate students and a reference work for econometricians. It will also be valuable to those doing statistical analysis in the other social sciences. Its main features are a thorough treatment of cross-section models, including qualitative response models, censored and truncated regression models, and Markov and duration models, as well as a rigorous presentation of large sample theory, classical least-squares and generalized least-squares theory, and nonlinear simultaneous equation models.\n\n                            Although the treatment is mathematically rigorous, the author has employed the theorem-proof method with simple, intuitively accessible assumptions. This enables readers to understand the basic structure of each theorem and to generalize it for themselves depending on their needs and abilities. Many simple applications of theorems are given either in the form of examples in the text or as exercises at the end of each chapter in order to demonstrate their essential points.\n"
	},
	{
		"Title": "Advanced Econometrics",
		"URL": "https://www.bookdepository.com/Advanced-Econometrics-Takeshi-Amemiya/9780674005600?ref=grid-view&qid=1662453154352&sr=1-59",
		"Review": "I took Amemiya's advanced econometrics class in graduate school and I cannot imagine a better introduction to graduate econometrics. The book reflects Amemiya's brilliance; topics are presented lucidly and logically. However, this book requires some mathematical background -- real analysis and linear algebra -- and is not a good first text in econometrics. Overall, I highly recommend it for people who want to learn how to think like an econometrician. It is absolutely essential for practicing econometricians."
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Gary-Koop/9780470032701?ref=grid-view&qid=1662453154352&sr=1-60",
		"Description": "Introduction to Econometrics has been written as a core textbook for a first course in econometrics taken by undergraduate or graduate students. It is intended for students taking a single course in econometrics with a view towards doing practical data work. It will also be highly useful for students interested in understanding the basics of econometric theory with a view towards future study of advanced econometrics. To achieve this end, it has a practical emphasis, showing how a wide variety of models can be used with the types of data sets commonly used by economists. However, it also has enough discussion of the underlying econometric theory to give the student a knowledge of the statistical tools used in advanced econometrics courses. Key Features: * A non-technical summary of the basic tools of econometrics is given in chapters 1 and 2, which allows the reader to quickly start empirical work. * The foundation offered in the first two chapters makes the theoretical econometric material, which begins in chapter 3, more accessible. * Provides a good balance between econometric theory and empirical applications.\n                            * Discusses a wide range of models used by applied economists including many variants of the regression model (with extensions for panel data), time series models (including a discussion of unit roots and cointegration) and qualitative choice models (probit and logit). An extensive collection of web-based supplementary materials is provided for this title, including: data sets, problem sheets with worked through answers, empirical projects, sample exercises with answers, and slides for lecturers.  URL: www.wileyeurope.com/college/koop\n"
	},
	{
		"Title": "Introduction to Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Econometrics-Gary-Koop/9780470032701?ref=grid-view&qid=1662453154352&sr=1-60",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Mathematics for Econometrics",
		"URL": "https://www.bookdepository.com/Mathematics-for-Econometrics-Phoebus-J-Dhrymes/9781461481447?ref=grid-view&qid=1662453297865&sr=1-61",
		"Description": "This book deals with a number of mathematical topics that are of great importance in the study of classical econometrics. There is a lengthy chapter on matrix algebra, which takes the reader from the most elementary aspects to the partitioned inverses, characteristic roots and vectors, symmetric, and orthogonal and positive (semi) definite matrices. The book also covers pseudo-inverses, solutions to systems of linear equations, solutions of vector difference equations with constant coefficients and random forcing functions, matrix differentiation, and permutation matrices. Its novel features include an introduction to asymptotic expansions, and examples of applications to the general-linear model (regression) and the general linear structural econometric model (simultaneous equations).\n"
	},
	{
		"Title": "Mathematics for Econometrics",
		"URL": "https://www.bookdepository.com/Mathematics-for-Econometrics-Phoebus-J-Dhrymes/9781461481447?ref=grid-view&qid=1662453297865&sr=1-61",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometric Analysis of Panel Data",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Panel-Data-Badi-H-Baltagi/9783030539528?ref=grid-view&qid=1662453297865&sr=1-62",
		"Description": "This textbook offers a comprehensive introduction to panel data econometrics, an area that has enjoyed considerable growth over the last two decades. Micro and Macro panels are becoming increasingly available, and methods for dealing with these types of data are in high demand among practitioners. Software programs have fostered this growth, including freely available programs in R and numerous user-written programs in both Stata and EViews.\n\n                            Written by one of the world's leading researchers and authors in the field, Econometric Analysis of Panel Data has established itself as the leading textbook for graduate and postgraduate courses on panel data. It provides up-to-date coverage of basic panel data techniques, illustrated with real economic applications and datasets, which are available at the book's website on springer.com. \n\n\n\n                            This new sixth edition has been fully revised and updated, and includes new material on dynamic panels, limited dependent variables and nonstationary panels, as well as spatial panel data. The author also provides empirical illustrations and examples using Stata and EViews. \n\n\n\n\n\n\n\n\n\n\n\n\n\n                            \"This is a definitive book written by one of the architects of modern, panel data econometrics. It provides both a practical introduction to the subject matter, as well as a thorough discussion of the underlying statistical principles without taxing the reader too greatly.\"\n                            Professor Kajal Lahiri, State University of New York, Albany, USA.\n\n\n\n                             \"This book is the most comprehensive work available on panel data. It is written by one of the leading contributors to the field, and is notable for its encyclopaedic coverage and its clarity of exposition. It is useful to theorists and to people doing applied work using panel data. It is valuable as a text for a course in panel data, as a supplementary text for more general courses in econometrics, and as a reference.\"\n                            Professor Peter Schmidt, Michigan State University, USA.\n\n                            \"Panel data econometrics is in its ascendancy, combining the power of cross section averaging with all the subtleties of temporal and spatial dependence. Badi Baltagi provides a remarkable roadmap of this fascinating interface of econometric method, enticing the novitiate with technical gentleness, the expert with comprehensive coverage and the practitioner with many empirical applications.\"\n                             Professor Peter C. B. Phillips, Cowles Foundation, Yale University, USA.\n"
	},
	{
		"Title": "Econometric Analysis of Panel Data",
		"URL": "https://www.bookdepository.com/Econometric-Analysis-Panel-Data-Badi-H-Baltagi/9783030539528?ref=grid-view&qid=1662453297865&sr=1-62",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Empirical Market Microstructure : The Institutions, Economics, and Econometrics of Securities Trading",
		"URL": "https://www.bookdepository.com/Empirical-Market-Microstructure-Joel-Hasbrouck/9780195301649?ref=grid-view&qid=1662453297865&sr=1-63",
		"Description": "The interactions that occur in securities markets are among the fastest, most information-intensive, and most highly strategic of all economic phenomena. Empirical Market Microstructure is about the institutions that have evolved to handle our trading needs, the economic forces that guide our strategies, and statistical methods of using and interpreting the vast amount of information that these markets produce.  The empirical methods\n                            discussed in the book draw on the power of multivariate linear time series analysis. The book discusses the application of univariate ARMA analysis to trade prices, vector autoregressions to price and order\n                            data, and vector error correction models to situations where the same security is traded in many markets. In these models, the tools of random-walk decomposition and co-integration emerge as important to specification and interpretation.   The statistical specifications dont simply arise, however, as progressively more refined descriptive models; they have strong economic underpinnings arising from asymmetric information, inventory control, and the strategies of their\n                            participants. These topics are discusssed, interleaving with and emphasizing the connection to the statistical models.   From a practical viewpoint, many of these models will be\n                            estimated to calibrate real-world trading strategies. Some market participants will be trying to discern strategies that generate profits from short-term trading. A much greater number, though, will be trying to accomplish trades that help diversify, hedge or reallocate a portfolio. Trading is not, for these agents, their primary economic purpose. They are simply trying to satisfy their trading needs at a minimal cost. The final part of the book discusses how these costs are measured, and\n                            strategies to minimize them--both by splitting orders over time, and by the judicious use of limit orders.   The book includes numerous exercises; solutions and other supporting\n                            materials are available on the author's web site.\n"
	},
	{
		"Title": "Empirical Market Microstructure : The Institutions, Economics, and Econometrics of Securities Trading",
		"URL": "https://www.bookdepository.com/Empirical-Market-Microstructure-Joel-Hasbrouck/9780195301649?ref=grid-view&qid=1662453297865&sr=1-63",
		"Review": "Ok book, not much in here that is interesting anymore."
	},
	{
		"Title": "Empirical Market Microstructure : The Institutions, Economics, and Econometrics of Securities Trading",
		"URL": "https://www.bookdepository.com/Empirical-Market-Microstructure-Joel-Hasbrouck/9780195301649?ref=grid-view&qid=1662453297865&sr=1-63",
		"Review": "May need to read it again later some time."
	},
	{
		"Title": "Introduction to Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Bayesian-Econometrics-Edward-Greenberg/9781107436770?ref=grid-view&qid=1662453297865&sr=1-64",
		"Description": "This textbook explains the basic ideas of subjective probability and shows how subjective probabilities must obey the usual rules of probability to ensure coherency. It defines the likelihood function, prior distributions and posterior distributions. It explains how posterior distributions are the basis for inference and explores their basic properties. Various methods of specifying prior distributions are considered, with special emphasis on subject-matter considerations and exchange ability. The regression model is examined to show how analytical methods may fail in the derivation of marginal posterior distributions. The remainder of the book is concerned with applications of the theory to important models that are used in economics, political science, biostatistics and other applied fields. New to the second edition is a chapter on semiparametric regression and new sections on the ordinal probit, item response, factor analysis, ARCH-GARCH and stochastic volatility models. The new edition also emphasizes the R programming language.\n"
	},
	{
		"Title": "Introduction to Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Introduction-Bayesian-Econometrics-Edward-Greenberg/9781107436770?ref=grid-view&qid=1662453297865&sr=1-64",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "An Introduction to Applied Econometrics : A Time Series Approach",
		"URL": "https://www.bookdepository.com/Introduction-Applied-Econometrics-Kerry-Patterson/9780333802465?ref=grid-view&qid=1662453297865&sr=1-65",
		"Description": "This new text is designed to make modern econometric techniques accessible and understandable to the non-specialist. It introduces and explains techniques that are now widely used in applied work, although rarely introduced in any detail in introductory level texts, such as integrated time series, cointegration, simulation analysis, Johansen's Approach to multivariate co-integration and ARCH. The author explains the central distinction between stationary and nonstationary time series, which is of crucial importance in many areas of analysis, especially in macroeconomics and financial economics.\n                            Visit: www.palgrave.com/economics/patterson for more information\n"
	},
	{
		"Title": "An Introduction to Applied Econometrics : A Time Series Approach",
		"URL": "https://www.bookdepository.com/Introduction-Applied-Econometrics-Kerry-Patterson/9780333802465?ref=grid-view&qid=1662453297865&sr=1-65",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Environmental Econometrics Using Stata",
		"URL": "https://www.bookdepository.com/Environmental-Econometrics-Using-Stata-Christopher-F-Baum/9781597183550?ref=grid-view&qid=1662453297865&sr=1-66",
		"Description": "Aspects of environmental change are some of the greatest challenges faced by policymakers today. The key issues addressed by environmental science are often empirical, and in many instances very detailed, sizable datasets are available. Researchers in this field should have a solid understanding of the econometric tools best suited for analysis of these data. While complex and expensive physical models of the environment exist, it is becoming increasingly clear that reduced-form econometric models have an important role to play in modeling environmental phenomena. In short, successful environmental modeling does not necessarily require a structural model, but the econometric methods underlying a reduced-form approach must be competently executed. \n\n\n                            Environmental Econometrics Using Stata provides an important starting point for this journey by presenting a broad range of applied econometric techniques for environmental econometrics and illustrating how they can be applied in Stata. The emphasis is not only on how to formulate and fit models in Stata but also on the need to use a wide range of diagnostic tests in order to validate the results of estimation and subsequent policy conclusions. This focus on careful, reproducible research should be appreciated by academic and non-academic researchers who are seeking to produce credible, defensible conclusions about key issues in environmental science.\n"
	},
	{
		"Title": "Environmental Econometrics Using Stata",
		"URL": "https://www.bookdepository.com/Environmental-Econometrics-Using-Stata-Christopher-F-Baum/9781597183550?ref=grid-view&qid=1662453297865&sr=1-66",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Volatility and Time Series Econometrics : Essays in Honor of Robert Engle",
		"URL": "https://www.bookdepository.com/Volatility-Time-Series-Econometrics-Tim-Bollerslev/9780199549498?ref=grid-view&qid=1662453297865&sr=1-67",
		"Description": "Robert Engle received the Nobel Prize for Economics in 2003 for his work in time series econometrics. This book contains 16 original research contributions by some the leading academic researchers in the fields of time series econometrics, forecasting, volatility modelling, financial econometrics and urban economics, along with historical perspectives related to field of time series econometrics more generally. \n\n                            Engle's Nobel Prize citation focuses on his path-breaking work on autoregressive conditional heteroskedasticity (ARCH) and the profound effect that this work has had on the field of financial econometrics. Several of the chapters focus on conditional heteroskedasticity, and develop the ideas of Engle's Nobel Prize winning work. Engle's work has had its most profound effect on the modelling of financial variables and several of the chapters use newly developed time series methods to study the\n                            behavior of financial variables. Each of the 16 chapters may be read in isolation, but they all importantly build on and relate to the seminal work by Nobel Laureate Robert F. Engle.\n"
	},
	{
		"Title": "Volatility and Time Series Econometrics : Essays in Honor of Robert Engle",
		"URL": "https://www.bookdepository.com/Volatility-Time-Series-Econometrics-Tim-Bollerslev/9780199549498?ref=grid-view&qid=1662453297865&sr=1-67",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Putting Econometrics in its Place : A New Direction in Applied Economics",
		"URL": "https://www.bookdepository.com/Putting-Econometrics-its-Place-G-M-P-Swann/9781847207760?ref=grid-view&qid=1662453297865&sr=1-68",
		"Description": "Putting Econometrics in its Place is an original and fascinating book, in which Peter Swann argues that econometrics has dominated applied economics for far too long and displaced other essential techniques. While Peter Swann is critical of the monopoly that econometrics currently holds in applied economics, the more important and positive contribution of the book is to propose a new direction and a new attitude to applied economics.\n\n                            The advance of econometrics from its early days has been a massive achievement, but it has also been problematic; practical results from the use of econometrics are often disappointing. The author argues that to get applied economics back on course economists must use a much wider variety of research techniques, and must once again learn to respect vernacular knowledge of the economy. This vernacular includes the knowledge gathered by ordinary people from their everyday interactions with markets. While vernacular knowledge is often unsystematic and informal, it offers insights that can never be found from formal analysis alone. \n\n                            As a serious, original and sometimes contentious book, its readership will be varied and international. Scholars throughout the many fields of economics - both skilled and unskilled in econometrics - are likely to be intrigued by the serious alternative approaches outlined within the book. It will also appeal to communities of economists outside economics departments in government, industry and business as well as business and management schools. Research centres for applied economics, policy research and innovation research, will also find it of interest due to its focus on getting reliable results rather than methodological orthodoxy for its own sake.\n"
	},
	{
		"Title": "Putting Econometrics in its Place : A New Direction in Applied Economics",
		"URL": "https://www.bookdepository.com/Putting-Econometrics-its-Place-G-M-P-Swann/9781847207760?ref=grid-view&qid=1662453297865&sr=1-68",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Description": "This book provides the first comprehensive treatment of feed-forward neural networks from the perspective of statistical pattern recognition.  After introducing the basic concepts of pattern recognition, the book describes techniques for modelling probability density functions, and discusses the properties and relative merits of the multi-layer perceptron and radial basis function network models.   It also motivates the use of various forms of error functions, and\n                            reviews the principal algorithms for error function minimization.  As well as providing a detailed discussion of learning and generalization in neural networks, the book also covers the important topics of data processing, feature extraction, and prior knowledge.  The book concludes with an extensive\n                            treatment of Bayesian techniques and their applications to neural networks.\n"
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Review": "A great book on the use of neural network as they apply to pattern recognition. This book is understandably heavy on the mathematical aspects of things, but the author does so with a grain of salt. This is definitely not a mathematics book."
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Review": "Most books about neural networks are silent when it comes to less obvious details of what training feedforward networks actually does, and what the result of the network represents. This book analyzes all these details by means of statistics, and consequently gives a very solid foundation for understanding neural networks. The definitive book for feedforward neural networks - extremely good! The math-heavy treatise makes it unsuitable for a beginners book, though."
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Review": "Along with the regular content has introduction to linear algebra and other mathematical prerquisites.Presents the intuitions behind the methods."
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Review": "My ratings of books on Goodreads are solely a crude ranking of their utility to me, and not an evaluation of literary merit, entertainment value, social importance, humor, insightfulness, scientific accuracy, creative vigor, suspensefulness of plot, depth of characters, vitality of theme, excitement of climax, satisfaction of ending, or any other combination of dimensions of value which we are expected to boil down through some fabulous alchemy into a single digit."
	},
	{
		"Title": "Neural Networks for Pattern Recognition",
		"URL": "https://www.bookdepository.com/Neural-Networks-for-Pattern-Recognition-Christopher-M-Bishop/9780198538646?ref=grid-view&qid=1662453297865&sr=1-69",
		"Review": "intro to neural networks"
	},
	{
		"Title": "Econometric Methods for Labour Economics",
		"URL": "https://www.bookdepository.com/Econometric-Methods-for-Labour-Economics-Stephen-Bazen/9780199576791?ref=grid-view&qid=1662453297865&sr=1-70",
		"Description": "This book provides an accessible presentation of the standard statistical techniques used by labour economists. It emphasises both the input and the output of empirical analysis and covers five major topics concerning econometric methods used in labour economics: regression and related methods, choice modelling, selectivity issues, duration analysis, and policy evaluation techniques. Each of these is presented in terms of model specification, possible estimation\n                            problems, diagnostic checking, and interpretation of the output. It aims to provide guidance to practitioners on how to use the techniques and how to make sense of the results that are produced. It covers methods that are considered to be 'standard' tools in labour economics, but which are often given\n                            only a brief and highly technical treatment in econometrics textbooks.   \n\n                            It will be a useful reference for postgraduates and advanced undergraduates, researchers embarking on empirical labour market analysis, and for more experienced economists wishing to apply these techniques for the first time.\n"
	},
	{
		"Title": "Econometric Methods for Labour Economics",
		"URL": "https://www.bookdepository.com/Econometric-Methods-for-Labour-Economics-Stephen-Bazen/9780199576791?ref=grid-view&qid=1662453297865&sr=1-70",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Nonparametric Econometrics",
		"URL": "https://www.bookdepository.com/Nonparametric-Econometrics-Adrian-Pagan/9780521586115?ref=grid-view&qid=1662453297865&sr=1-71",
		"Description": "This book systematically and thoroughly covers the vast literature on the nonparametric and semiparametric statistics and econometrics that has evolved over the last five decades. Within this framework this is the first book to discuss the principles of the nonparametric approach to the topics covered in a first year graduate course in econometrics, e.g. regression function, heteroskedasticity, simultaneous equations models, logit-probit and censored models. Nonparametric and semiparametric methods potentially offer considerable reward to applied researchers, owing to the methods' ability to adapt to many unknown features of the data. Professors Pagan and Ullah provide intuitive explanations of difficult concepts, heuristic developments of theory, and empirical examples emphasizing the usefulness of the modern nonparametric approach. The book should provide a new perspective on teaching and research in applied subjects in general and econometrics and statistics in particular.\n"
	},
	{
		"Title": "Nonparametric Econometrics",
		"URL": "https://www.bookdepository.com/Nonparametric-Econometrics-Adrian-Pagan/9780521586115?ref=grid-view&qid=1662453297865&sr=1-71",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Spatial Econometrics : From Cross-Sectional Data to Spatial Panels",
		"URL": "https://www.bookdepository.com/Spatial-Econometrics-J-Paul-Elhorst/9783642403392?ref=grid-view&qid=1662453297865&sr=1-72",
		"Description": "This book provides an overview of three generations of spatial econometric models: models based on cross-sectional data, static models based on spatial panels and dynamic spatial panel data models. The book not only presents different model specifications and their corresponding estimators, but also critically discusses the purposes for which these models can be used and how their results should be interpreted.\n"
	},
	{
		"Title": "Spatial Econometrics : From Cross-Sectional Data to Spatial Panels",
		"URL": "https://www.bookdepository.com/Spatial-Econometrics-J-Paul-Elhorst/9783642403392?ref=grid-view&qid=1662453297865&sr=1-72",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Real Econometrics : The Right Tools to Answer Important Questions",
		"URL": "https://www.bookdepository.com/Real-Econometrics-Michael-Bailey/9780190857462?ref=grid-view&qid=1662453297865&sr=1-73",
		"Description": "An engaging and practical introduction to econometrics, Real Econometrics: The Right Tools to Answer Important Questions, offers thorough coverage of the most frequently used methods of analysis. Grounded in contemporary understandings of causal inference, the text invites students to extract meaningful information about important economic policy issues from available data. Bailey's emphasis on practical applications, combined with a lively and\n                            conversational narrative and a diverse array of examples and case studies, provides students with a solid foundation in the analytical tools they will use throughout their academic and professional careers. The second edition includes new conceptual exercises, revised appendices, and additional code and guidance for R\n                            software.\n"
	},
	{
		"Title": "Real Econometrics : The Right Tools to Answer Important Questions",
		"URL": "https://www.bookdepository.com/Real-Econometrics-Michael-Bailey/9780190857462?ref=grid-view&qid=1662453297865&sr=1-73",
		"Review": "Bailey's writing is remarkably engaging, but at times is absolutely cracked. On several occasions, I stared in bewilderment at the page wondering how exactly parts of this were published. Bailey simply can't resist making a quip here and there, and on occasion are so jarring that they actually distract from the course material. Real Econometrics doesn't function particularly well as a reference guide either, though it most certainly isn't written as one. Despite this, however, Real Econometrics is extremely well-presented and well-written, and I would recommend it for any introductory econometrics course. Overall, this textbook is a good introduction to economic research, if perhaps a little shocking at times. One star is deducted for the absence of an ebook or pdf version."
	},
	{
		"Title": "Real Econometrics : The Right Tools to Answer Important Questions",
		"URL": "https://www.bookdepository.com/Real-Econometrics-Michael-Bailey/9780190857462?ref=grid-view&qid=1662453297865&sr=1-73",
		"Review": "An actually helpful, engaging, and applicable textbook. "
	},
	{
		"Title": "Real Econometrics : The Right Tools to Answer Important Questions",
		"URL": "https://www.bookdepository.com/Real-Econometrics-Michael-Bailey/9780190857462?ref=grid-view&qid=1662453297865&sr=1-73",
		"Review": "                    click here."
	},
	{
		"Title": "Applied Econometrics : A Practical Guide",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-Chung-ki-Min/9780367110338?ref=grid-view&qid=1662453297865&sr=1-74",
		"Description": "Applied Econometrics: A Practical Guide is an extremely user-friendly and application-focused book on econometrics. Unlike many econometrics textbooks which are heavily theoretical on abstractions, this book is perfect for beginners and promises simplicity and practicality to the understanding of econometric models. Written in an easy-to-read manner, the book begins with hypothesis testing and moves forth to simple and multiple regression models. It also includes advanced topics:\n\n\n\n                            Endogeneity and Two-stage Least Squares\n                            Simultaneous Equations Models\n                            Panel Data Models\n                            Qualitative and Limited Dependent Variable Models\n                            Vector Autoregressive (VAR) Models\n                            Autocorrelation and ARCH/GARCH Models\n                            Unit Root and Cointegration\n\n                            The book also illustrates the use of computer software (EViews, SAS and R) for economic estimating and modeling. Its practical applications make the book an instrumental, go-to guide for solid foundation in the fundamentals of econometrics. In addition, this book includes excerpts from relevant articles published in top-tier academic journals. This integration of published articles helps the readers to understand how econometric models are applied to real-world use cases.\n"
	},
	{
		"Title": "Applied Econometrics : A Practical Guide",
		"URL": "https://www.bookdepository.com/Applied-Econometrics-Chung-ki-Min/9780367110338?ref=grid-view&qid=1662453297865&sr=1-74",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Financial Econometrics : From Basics to Advanced Modeling Techniques",
		"URL": "https://www.bookdepository.com/Financial-Econometrics-Svetlozar-T-Rachev/9780471784500?ref=grid-view&qid=1662453297865&sr=1-75",
		"Description": "A comprehensive guide to financial econometrics Financial econometrics is a quest for models that describe financial time series such as prices, returns, interest rates, and exchange rates. In Financial Econometrics, readers will be introduced to this growing discipline and the concepts and theories associated with it, including background material on probability theory and statistics. The experienced author team uses real-world data where possible and brings in the results of published research provided by investment banking firms and journals. Financial Econometrics clearly explains the techniques presented and provides illustrative examples for the topics discussed. Svetlozar T. Rachev, PhD (Karlsruhe, Germany) is currently Chair-Professor at the University of Karlsruhe. Stefan Mittnik, PhD (Munich, Germany) is Professor of Financial Econometrics at the University of Munich. Frank J. Fabozzi, PhD, CFA, CFP (New Hope, PA) is an adjunct professor of Finance at Yale University's School of Management. Sergio M. Focardi (Paris, France) is a founding partner of the Paris-based consulting firm The Intertek Group.\n                            Teo Jasic, PhD, (Frankfurt, Germany) is a senior manager with a leading international management consultancy firm in Frankfurt.\n"
	},
	{
		"Title": "Financial Econometrics : From Basics to Advanced Modeling Techniques",
		"URL": "https://www.bookdepository.com/Financial-Econometrics-Svetlozar-T-Rachev/9780471784500?ref=grid-view&qid=1662453297865&sr=1-75",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics and Data Analysis for Developing Countries",
		"URL": "https://www.bookdepository.com/Econometrics-Data-Analysis-for-Developing-Countries-Chandan-Mukherjee/9780415094009?ref=grid-view&qid=1662453297865&sr=1-76",
		"Description": "Getting accurate data on less developed countries has created great problems for studying these areas. Yet until recently students of development economics have relied on standard econometrics texts, which assume a Western context. Econometrics and Data Analysis for Developing Countries solves this problem. It will be essential reading for all advanced students of development economics.\n"
	},
	{
		"Title": "Econometrics and Data Analysis for Developing Countries",
		"URL": "https://www.bookdepository.com/Econometrics-Data-Analysis-for-Developing-Countries-Chandan-Mukherjee/9780415094009?ref=grid-view&qid=1662453297865&sr=1-76",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Dynamic Econometrics For Empirical Macroeconomic Modelling",
		"URL": "https://www.bookdepository.com/Dynamic-Econometrics-For-Empirical-Macroeconomic-Modelling-Ragnar-Nymoen/9789811249471?ref=grid-view&qid=1662453297865&sr=1-77",
		"Description": "For Masters and PhD students in EconomicsIn this textbook, the duality between the equilibrium concept used in dynamic economic theory and the stationarity of economic variables is explained and used in the presentation of single equations models and system of equations such as VARs, recursive models and simultaneous equations models.The book also contains chapters on: exogeneity, in the context of estimation, policy analysis and forecasting; automatic (computer based) variable selection, and how it can aid in the specification of an empirical macroeconomic model; and finally, on a common framework for model-based economic forecasting.Supplementary materials and notes are available on the publisher's website.\n"
	},
	{
		"Title": "Dynamic Econometrics For Empirical Macroeconomic Modelling",
		"URL": "https://www.bookdepository.com/Dynamic-Econometrics-For-Empirical-Macroeconomic-Modelling-Ragnar-Nymoen/9789811249471?ref=grid-view&qid=1662453297865&sr=1-77",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics : New Research",
		"URL": "https://www.bookdepository.com/Econometrics-Santiago-Mendez/9781619420052?ref=grid-view&qid=1662453297865&sr=1-78",
		"Description": "Two main purposes of econometrics are to give empirical content to economic theory by formulating economic models in testable form and to estimate those models and test them as to acceptance or rejection. This book also discusses empirical estimations of FDI spillovers, and econometric modelling of time to event data.\n"
	},
	{
		"Title": "Econometrics : New Research",
		"URL": "https://www.bookdepository.com/Econometrics-Santiago-Mendez/9781619420052?ref=grid-view&qid=1662453297865&sr=1-78",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics : A Simple Introduction",
		"URL": "https://www.bookdepository.com/Econometrics-K-H-Erickson/9781496013866?ref=grid-view&qid=1662453297865&sr=1-79",
		"Description": "Econometrics: A Simple Introduction offers an accessible guide to the principles and methods of econometrics, with data samples, regressions, equations and diagrams to illustrate the analysis.\n\n\n\n\n                            Examine a linear and multiple regression model, ordinary least squares method, and the Gauss-Markov conditions for a best linear unbiased estimator.\n\n\n\n\n                            Understand hypothesis testing, with a null hypothesis, t, F or chi-square test statistics and distributions, and interpret regression results. Dummy variables model qualitative data and Chow tests assess regression equivalence.\n\n\n\n\n                            Explore heteroscedasticity with the White method and with generalized least squares, Goldfeld-Quandt, Breusch-Pagan, and White tests. Assess autocorrelation with Durbin-Watson, Durbin h, and Breusch-Godfrey tests, lagged variables and auxiliary regressions.\n\n\n\n\n                            Assess the impact of omitted variables, incorrect variables or functional form, and a non-normal distribution with Ramsey RESET and Jarque-Bera tests. Model random variables with the Method of Moments' estimators, instrumental variables and Hausman test.\n"
	},
	{
		"Title": "Econometrics : A Simple Introduction",
		"URL": "https://www.bookdepository.com/Econometrics-K-H-Erickson/9781496013866?ref=grid-view&qid=1662453297865&sr=1-79",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-K-Nirmal-Ravi-Kumar/9780367518264?ref=grid-view&qid=1662453297865&sr=1-80",
		"Description": "This book harbors an updated and standard material on the various aspects of Econometrics. It covers both fundamental and applied aspects and is intended to serve as a basis for a course in Econometrics and attempts at satisfying a need of postgraduate and doctoral students of Economics. It is hoped that, this book will also be worthwhile to teachers, researchers, professionals etc.\n\n                            Note: T& F does not sell or distribute the Hardback in India, Pakistan, Nepal, Bhutan, Bangladesh and Sri Lanka.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-K-Nirmal-Ravi-Kumar/9780367518264?ref=grid-view&qid=1662453297865&sr=1-80",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Bayesian Econometric Methods",
		"URL": "https://www.bookdepository.com/Bayesian-Econometric-Methods-Joshua-Chan/9781108437493?ref=grid-view&qid=1662453297865&sr=1-81",
		"Description": "Bayesian Econometric Methods examines principles of Bayesian inference by posing a series of theoretical and applied questions and providing detailed solutions to those questions. This second edition adds extensive coverage of models popular in finance and macroeconomics, including state space and unobserved components models, stochastic volatility models, ARCH, GARCH, and vector autoregressive models. The authors have also added many new exercises related to Gibbs sampling and Markov Chain Monte Carlo (MCMC) methods. The text includes regression-based and hierarchical specifications, models based upon latent variable representations, and mixture and time series specifications. MCMC methods are discussed and illustrated in detail - from introductory applications to those at the current research frontier - and MATLAB (R) computer programs are provided on the website accompanying the text. Suitable for graduate study in economics, the text should also be of interest to students studying statistics, finance, marketing, and agricultural economics.\n"
	},
	{
		"Title": "Bayesian Econometric Methods",
		"URL": "https://www.bookdepository.com/Bayesian-Econometric-Methods-Joshua-Chan/9781108437493?ref=grid-view&qid=1662453297865&sr=1-81",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics : Statistical Foundations and Applications",
		"URL": "https://www.bookdepository.com/Econometrics-P-J-Dhrymes/9780387900957?ref=grid-view&qid=1662453297865&sr=1-82",
		"Description": "This is a Print on Demand title. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc.\n"
	},
	{
		"Title": "Econometrics : Statistical Foundations and Applications",
		"URL": "https://www.bookdepository.com/Econometrics-P-J-Dhrymes/9780387900957?ref=grid-view&qid=1662453297865&sr=1-82",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Jan-Tinbergen/9780415407090?ref=grid-view&qid=1662453297865&sr=1-83",
		"Description": "Originally published in 1951, this volume reprints the classic work written by one of the leading global econometricians.\n                            Econometrics is structured as followed:\n                            Part 1 explains the relationship of Econometrics to Economics and Statistics.\n                            Part 2 outlines the process of formulating economic hypotheses mathematically and of subjecting them to a statistical test.\n                            Part 3 deals with the various component equations of the economic system - the psychic reactions, technical relations and reactions of business life and describes the process of setting up an economic model of the system as a whole.\n                            Part 4 llustrates the use of econometric methods for policy purposes.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Jan-Tinbergen/9780415407090?ref=grid-view&qid=1662453297865&sr=1-83",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-John-Eatwell/9780333495438?ref=grid-view&qid=1662453297865&sr=1-84",
		"Description": "This is an excerpt from the 4-volume dictionary of economics, a reference book which aims to define the subject of economics today. 1300 subject entries in the complete work cover the broad themes of economic theory. This extract concentrates on econometrics.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-John-Eatwell/9780333495438?ref=grid-view&qid=1662453297865&sr=1-84",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Gerhard-Tintner/9781258766603?ref=grid-view&qid=1662453297865&sr=1-86",
		"Description": "This book is a facsimile reprint and may contain imperfections such as marks, notations, marginalia and flawed pages.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Gerhard-Tintner/9781258766603?ref=grid-view&qid=1662453297865&sr=1-86",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-William-Greene/9780131871106?ref=grid-view&qid=1662453297865&sr=1-87",
		"Description": "None"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-William-Greene/9780131871106?ref=grid-view&qid=1662453297865&sr=1-87",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Tara-Prasad-Bhusal/9786137437629?ref=grid-view&qid=1662453297865&sr=1-88",
		"Description": "Econometrics is intended for the post graduate course in econometrics for social sciences and management. This book is equally useful to the researchers and other academicians who are dealing with econometric models and forecasting. Some of the major features of this book are that it provides an up-to-date coverage of correlation and regression, OLS assumptions and violation of OLS assumptions: multicollinearity, hoteroscedasticity, autocorrelation. There is the insight explanation of the use of dummy regressors and limited dependent variables models in the book. The rest of the chapters are devoted for simultaneous equations: identification and estimation, distributed lag models, forecasting and simulation and time series models.\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Tara-Prasad-Bhusal/9786137437629?ref=grid-view&qid=1662453297865&sr=1-88",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Franco-Peracchi/9780471987642?ref=grid-view&qid=1662453297865&sr=1-89",
		"Description": "In Econometrics the author has provided a text that bridges the gap between classical econometrics (with an emphasis on linear methods such as OLS, GLS and instrumental variables) and some of the key research areas of the last few years, including sampling problems, nonparametric methods and panel data analysis. Designed for advanced undergraduates and postgraduate students of the subject, Econometrics provides rigorous, yet accessible, coverage of the subject. Key features include: aeo A unified approach to statistical estimation emphasising the analogy (or bootstrap) principle aeo An introduction to bootstrap and jackknife methods for assessing the accuracy of an estimator aeo Detailed discussion of nonparametric methods for estimating density and regression of functions aeo Emphasis on diagnostic procedures and on prediction criteria for evaluating the results fo statistical analysis aeo An introduction to linear exponential family and generalized linear models aeo A thorough discussion of robustness in statistical sense\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Franco-Peracchi/9780471987642?ref=grid-view&qid=1662453297865&sr=1-89",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Peter-Schmidt/9780367403447?ref=grid-view&qid=1662453392927&sr=1-92",
		"Description": "\"A collection of proofs of fundamental theorems, this volume utilizes a format that is exhaustive and consistent. Every result covered in ``Econometrics''is proved as well as stated. One notation system is used throughout the volume. The topics included in the book cover such areas as estimations and testing in linear regression models under various sets of assumptions, and estimation and testing in simultaneous equations models. The latter subject is treated more extensively than in most econometrics books, and the entire volume is characterized by its rigorous level of examination. \"\n"
	},
	{
		"Title": "Econometrics",
		"URL": "https://www.bookdepository.com/Econometrics-Peter-Schmidt/9780367403447?ref=grid-view&qid=1662453392927&sr=1-92",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Mathematical Statistics for Applied Econometrics",
		"URL": "https://www.bookdepository.com/Mathematical-Statistics-for-Applied-Econometrics-Charles-B-Moss/9781466594098?ref=grid-view&qid=1662453392927&sr=1-93",
		"Description": "An Introductory Econometrics Text\n\n                            Mathematical Statistics for Applied Econometrics covers the basics of statistical inference in support of a subsequent course on classical econometrics. The book shows students how mathematical statistics concepts form the basis of econometric formulations. It also helps them think about statistics as more than a toolbox of techniques.\n\n                            Uses Computer Systems to Simplify Computation\n\n                            The text explores the unifying themes involved in quantifying sample information to make inferences. After developing the necessary probability theory, it presents the concepts of estimation, such as convergence, point estimators, confidence intervals, and hypothesis tests. The text then shifts from a general development of mathematical statistics to focus on applications particularly popular in economics. It delves into matrix analysis, linear models, and nonlinear econometric techniques.\n\n                            Students Understand the Reasons for the Results\n\n                            Avoiding a cookbook approach to econometrics, this textbook develops students' theoretical understanding of statistical tools and econometric applications. It provides them with the foundation for further econometric studies.\n"
	},
	{
		"Title": "Mathematical Statistics for Applied Econometrics",
		"URL": "https://www.bookdepository.com/Mathematical-Statistics-for-Applied-Econometrics-Charles-B-Moss/9781466594098?ref=grid-view&qid=1662453392927&sr=1-93",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Using Excel for Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Using-Excel-for-Principles-Econometrics-Genevieve-Briand/9781118032107?ref=grid-view&qid=1662453392927&sr=1-94",
		"Description": "Principles of Econometrics is an introductory book for undergraduate students in economics and finance, and can be used for MBA and first-year graduate students in many fields. The 4th Edition provides students with an understanding of why econometrics is necessary and a working knowledge of basic econometric tools. This text emphasizes motivation, understanding and implementation by introducing very simple economic models and asking economic questions that students can answer.\n"
	},
	{
		"Title": "Using Excel for Principles of Econometrics",
		"URL": "https://www.bookdepository.com/Using-Excel-for-Principles-Econometrics-Genevieve-Briand/9781118032107?ref=grid-view&qid=1662453392927&sr=1-94",
		"Review": "I am sure this was a good text when it used to be up to speed, but it is a little dated by now. It is also a little longer than I would have preferred as I do not need a comprehensive econometrics text. Econometrics is a very simple subject matter and does not require this many pages (it's extremely long)."
	},
	{
		"Title": "The Oxford Handbook of Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Oxford-Handbook-Bayesian-Econometrics-John-Geweke/9780199559084?ref=grid-view&qid=1662453392927&sr=1-95",
		"Description": "Bayesian econometric methods have enjoyed an increase in popularity in recent years. Econometricians, empirical economists, and policymakers are increasingly making use of Bayesian methods. This handbook is a single source for researchers and policymakers wanting to learn about Bayesian methods in specialized fields, and for graduate students seeking to make the final step from textbook learning to the research frontier. It contains contributions by leading Bayesians\n                            on the latest developments in their specific fields of expertise. The volume provides broad coverage of the application of Bayesian econometrics in the major fields of economics and related disciplines, including macroeconomics, microeconomics, finance, and marketing. It reviews the state of the art\n                            in Bayesian econometric methodology, with chapters on posterior simulation and Markov chain Monte Carlo methods, Bayesian nonparametric techniques, and the specialized tools used by Bayesian time series econometricians such as state space models and particle filtering. It also includes chapters on Bayesian principles and methodology.\n"
	},
	{
		"Title": "The Oxford Handbook of Bayesian Econometrics",
		"URL": "https://www.bookdepository.com/Oxford-Handbook-Bayesian-Econometrics-John-Geweke/9780199559084?ref=grid-view&qid=1662453392927&sr=1-95",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Non-Parametric Econometrics",
		"URL": "https://www.bookdepository.com/Non-Parametric-Econometrics-Ibrahim-Ahamada/9780199578009?ref=grid-view&qid=1662453392927&sr=1-97",
		"Description": "This book allows those with a basic knowledge of econometrics to learn the main nonparametric and semiparametric techniques used in econometric modelling, and how to apply them correctly.  It looks at kernel density estimation, kernel regression, splines, wavelets, and mixture models, and provides useful empirical examples throughout. Using empirical application, several economic topics are addressed, including income distribution, wage equation, economic\n                            convergence, the Phillips curve, interest rate dynamics, returns volatility, and housing prices. A helpful appendix also explains how to implement the methods using R. \n\n                            This useful book will appeal to practitioners and researchers who need an accessible introduction to nonparametric and semiparametric econometrics. The practical approach provides an overview of the main techniques without including too much focus on mathematical formulas. It also serves as an accompanying textbook for a basic course, typically at undergraduate or graduate level.\n"
	},
	{
		"Title": "Non-Parametric Econometrics",
		"URL": "https://www.bookdepository.com/Non-Parametric-Econometrics-Ibrahim-Ahamada/9780199578009?ref=grid-view&qid=1662453392927&sr=1-97",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Contemporary Bayesian Econometrics and Statistics",
		"URL": "https://www.bookdepository.com/Contemporary-Bayesian-Econometrics-Statistics-John-Geweke/9780471679325?ref=grid-view&qid=1662453392927&sr=1-98",
		"Description": "This titel offers tools to improve decision making in an imperfect world. This publication provides readers with a thorough understanding of Bayesian analysis that is grounded in the theory of inference and optimal decision making. \"Contemporary Bayesian Econometrics and Statistics\" provides readers with state-of-the-art simulation methods and models that are used to solve complex real-world problems. Armed with a strong foundation in both theory and practical problem-solving tools, readers discover how to optimize decision making when faced with problems that involve limited or imperfect data. The book begins by examining the theoretical and mathematical foundations of Bayesian statistics to help readers understand how and why it is used in problem solving. The author then describes how modern simulation methods make Bayesian approaches practical using widely available mathematical applications software.In addition, the author details how models can be applied to specific problems, including: linear models and policy choices; modeling with latent variables and missing data; time series models and prediction; and, comparison and evaluation of models.\n                            The publication has been developed and fine- tuned through a decade of classroom experience, and readers will find the author's approach very engaging and accessible. There are nearly 200 examples and exercises to help readers see how effective use of Bayesian statistics enables them to make optimal decisions.MATLAB and R computer programs are integrated throughout the book. An accompanying Web site provides readers with computer code for many examples and datasets. This publication is tailored for research professionals who use econometrics and similar statistical methods in their work. With its emphasis on practical problem solving and extensive use of examples and exercises, this is also an excellent textbook for graduate-level students in a broad range of fields, including economics, statistics, the social sciences, business, and public policy.\n"
	},
	{
		"Title": "Contemporary Bayesian Econometrics and Statistics",
		"URL": "https://www.bookdepository.com/Contemporary-Bayesian-Econometrics-Statistics-John-Geweke/9780471679325?ref=grid-view&qid=1662453392927&sr=1-98",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "Matrix Differential Calculus with Applications in Statistics & Econometrics Rev",
		"URL": "https://www.bookdepository.com/Matrix-Differential-Calculus-with-Applications-Statistics-Econometrics-Rev-JR-Magnus/9780471986331?ref=grid-view&qid=1662453392927&sr=1-99",
		"Description": "Matrix Differential Calculus With Applications in Statistics and Econometrics Revised Edition Jan R. Magnus, CentER, Tilburg University, The Netherlands and Heinz Neudecker, Cesaro, Schagen, The Netherlands \" .deals rigorously with many of the problems that have bedevilled the subject up to the present time.\" -- Stephen Pollock, Econometric Theory \"I continued to be pleasantly surprised by the variety and usefulness of its contents \" -- Isabella Verdinelli, Journal of the American Statistical Association Continuing the success of their first edition, Magnus and Neudecker present an exhaustive and self--contained revised text on matrix theory and matrix differential calculus. Matrix calculus has become an essential tool for quantitative methods in a large number of applications, ranging from social and behavioural sciences to econometrics. While the structure and successful elements of the first edition remain, this revised and updated edition contains many new examples and exercises. aeo Contains the essentials of multivariable calculus with an emphasis on the use of differentials aeo Many new examples and exercises aeo Fulfils the need for a unified and self--contained treatment of matrix differential calculus aeo Includes new developments in this field Part I presents a concise, yet thorough overview of matrix algebra, while the second part develops the theory of differentials.\n                            The remaining Parts III to VI combine the theory and application of matrix differential calculus providing the practitioner and researcher with both a quick review and a detailed reference. Visit our web page http://www.wiley.com/\n"
	},
	{
		"Title": "Matrix Differential Calculus with Applications in Statistics & Econometrics Rev",
		"URL": "https://www.bookdepository.com/Matrix-Differential-Calculus-with-Applications-Statistics-Econometrics-Rev-JR-Magnus/9780471986331?ref=grid-view&qid=1662453392927&sr=1-99",
		"Review": "There are no reviews yet."
	},
	{
		"Title": "An Introduction to the Advanced Theory and Practice of Nonparametric Econometrics : A Replicable Approach Using R",
		"URL": "https://www.bookdepository.com/Introduction-Advanced-Theory-Practice-Nonparametric-Econometrics-Jeffrey-S-Racine/9781108483407?ref=grid-view&qid=1662453392927&sr=1-100",
		"Description": "Interest in nonparametric methodology has grown considerably over the past few decades, stemming in part from vast improvements in computer hardware and the availability of new software that allows practitioners to take full advantage of these numerically intensive methods. This book is written for advanced undergraduate students, intermediate graduate students, and faculty, and provides a complete teaching and learning course at a more accessible level of theoretical rigor than Racine's earlier book co-authored with Qi Li, Nonparametric Econometrics: Theory and Practice (2007). The open source R platform for statistical computing and graphics is used throughout in conjunction with the R package np. Recent developments in reproducible research is emphasized throughout with appendices devoted to helping the reader get up to speed with R, R Markdown, TeX and Git.\n"
	},
	{
		"Title": "An Introduction to the Advanced Theory and Practice of Nonparametric Econometrics : A Replicable Approach Using R",
		"URL": "https://www.bookdepository.com/Introduction-Advanced-Theory-Practice-Nonparametric-Econometrics-Jeffrey-S-Racine/9781108483407?ref=grid-view&qid=1662453392927&sr=1-100",
		"Review": "There are no reviews yet."
	}
]